[
{"newsitem": ["\r\n\tA former Police Sub Inspector (SI) and a security assistant were today sentenced to 20 years and six months Rigorous Imprisonment (RI) by the Colombo High Court for the abductio..."], "date": [" June 07, 2018 02:51 pm"], "comments": ["Comments - 0 / views : 337 ", " "], "title": ["Police SI and security assistant sentenced over rape of two women"]},
{"newsitem": ["\r\n\tTwo Sri Lankan female passengers who arrived from Dubai have been apprehended by Customs officials at the Bandaranaike International Airport (BIA) while allegedly attempting to ..."], "date": [" June 07, 2018 02:11 pm"], "comments": ["Comments - 0 / views : 187 ", " "], "title": ["Two women arrested while trying to smuggle in gold slabs"]},
{"newsitem": ["\r\n\tA foreign female traveling to Beijing from the Bandaranaike Ineternational Airport (BIA) were apprehended by Customs officials while attempting to smuggle out Rs.1,275,000.&nbsp..."], "date": [" June 07, 2018 12:39 pm"], "comments": ["Comments - 0 / views : 192 ", " "], "title": ["Foreign female caught trying to smuggle over Rs.1.2 million"]},
{"newsitem": ["\r\n\tA tense situation has been reported at the Maharagama Urban Council this morning after six new councilors representing the Sri Lanka Podujana Peramuna (SLPP) were sworn in.&nbsp..."], "date": [" June 07, 2018 11:55 am"], "comments": ["Comments - 0 / views : 101 ", " "], "title": ["Tense situation at Maharagama UC"]},
{"newsitem": ["\r\n\tA Sri Lankan man who threatened to set off a bomb on a Malaysian Airlines  flight from Melbourne will serve at least nine years in jail.\r\n\r\n\r\n\r\n\tAccording  to an Austr..."], "date": [" June 07, 2018 10:25 am"], "comments": ["Comments - 0 / views : 195 ", " "], "title": ["Sri Lankan who threatened to set off a bomb aboard a Malaysian Airlines flight is to serve at least nine years in jail"]},
{"newsitem": ["\r\n\tThree months after Sri Lanka was rocked by deadly anti-Muslim riots fuelled by online vitriol, Facebook is training its staff to identify inflammatory content in the country'..."], "date": [" June 07, 2018 10:09 am"], "comments": ["Comments - 0 / views : 73 ", " "], "title": ["Facebook staff to learn to identify inflammatory content after  Lankan riots"]},
{"newsitem": ["\r\n\t\r\n\t\r\n\tSri Lanka is fast losing its economic sovereignty and the government’s position at the UN Human Rights Council and declarations reveal that Sri Lanka no longer enjoy..."], "date": [" June 07, 2018 10:06 am"], "comments": ["Comments - 1 / views : 559 ", " "], "title": ["Lankan think-tanks controlled by US, alleges former Lankan ambassador"]},
{"newsitem": ["\r\n\tThe son of State Minister Palitha Range Bandara and the Chairman of the Puttalam Pradeshiya Sabha have been admitted to the Chilaw Hospital due to injuries sustained in a road a..."], "date": [" June 06, 2018 03:29 pm"], "comments": ["Comments - 0 / views : 111 ", " "], "title": ["State Minister Range Bandara's son among injured in accident"]},
{"newsitem": ["\r\n\tThe Telecommunications Regulatory Commission of Sri Lanka (TRCSL) claims that it took measures to shut down the Polgahawela transmission centre belonging to Telshan Network (Pvt..."], "date": [" June 06, 2018 12:28 pm"], "comments": ["Comments - 0 / views : 130 ", " "], "title": ["Update: TRCSL claims no undue ambition behind shutting down TNL transmission"]},
{"newsitem": ["\r\n\tA 28-year-old Sri Lankan male passenger who was leaving for Singapore was apprehended by Customs officials at the Bandaranaike International Airport (BIA) while attempting to sm..."], "date": [" June 06, 2018 12:14 pm"], "comments": ["Comments - 0 / views : 87 ", " "], "title": ["Lankan arrested with more than Rs.47 million in foreign currency"]},
{"newsitem": ["\r\n\tPolice have identified the main suspect in the shooting of Chief Incumbent of the Kataragama Kirivehera Rajamaha Viharaya, Ven. Kobawaka Damminda Thera.\r\n\r\n\r\n\r\n\tAccording t..."], "date": [" June 14, 2018 11:16 am"], "comments": ["Comments - 0 / views : 79 ", " "], "title": ["Main suspect in Kirivehera Chief Prelate's shooting named"]},
{"newsitem": ["\r\n\tRumble in the Jungle, an adventure-themed off-road bicycle race being held currently in Sri Lanka, was suspended on Wednesday after a rider went missing, the national carrier sa..."], "date": [" June 13, 2018 07:08 pm"], "comments": ["Comments - 0 / views : 150 ", " "], "title": ["SriLankan Airlines adventure event suspended after one rider went missing"]},
{"newsitem": ["\r\n\tTwelve line houses Paulmorl Estate in Agarapathana, Hatton were completely destroyed after a major fire erupted this morning. \r\n\r\n\r\n\r\n\tThe fire left the homes complete..."], "date": [" June 13, 2018 04:35 pm"], "comments": ["Comments - 0 / views : 55 ", " "], "title": ["Fire destroys 12 line houses in Hatton"]},
{"newsitem": ["\r\n\tFormer Director of Military Intelligence, Major General (Retired) Amal Karunasekara was today further remanded in custody until June 26 by the Mount Lavinia Magistrate's Co..."], "date": [" June 13, 2018 04:11 pm"], "comments": ["Comments - 0 / views : 43 ", " "], "title": ["Former Military Intelligence Director further remanded"]},
{"newsitem": ["\r\n\tA march was held in Galle Town on Monday (11) to raise awareness on the viral Influenza that is spreading in the Southern Province. \r\n\r\n\r\n\r\n\tHandbills to educate the p..."], "date": [" June 13, 2018 12:45 pm"], "comments": ["Comments - 0 / views : 83 ", " "], "title": ["March in Galle to raise awareness on viral influenza"]},
{"newsitem": ["\r\n\tMore than 20 houses and shops sustained damage due to strong winds that blew through the Hungama town and its surroundings at around 2.30 this morning (13), the Hambantota Distr..."], "date": [" June 13, 2018 12:26 pm"], "comments": ["Comments - 0 / views : 46 ", " "], "title": ["Strong winds cause severe damage to houses and shops in Hungama"]},
{"newsitem": ["\r\n\tConstruction of a walking path, known as 'Ocean Pathway,' which goes around Galle town, commenced yesterday (12) near the Galle Beach Park. \r\n\r\n\r\n\r\n\tThe walking p..."], "date": [" June 13, 2018 11:59 am"], "comments": ["Comments - 0 / views : 88 ", " "], "title": ["A new walking path for Galle Town"]},
{"newsitem": ["\r\n\tFive persons were injured after a bus overturned near the 121 kilometer post on the Southern Expressway at about 5.30 morning (13). \r\n\r\n\r\n\r\n\tThe injured have been admi..."], "date": [" June 13, 2018 11:34 am"], "comments": ["Comments - 0 / views : 77 ", " "], "title": ["Five injured after bus overturns on Southern Expressway"]},
{"newsitem": ["\r\n\tChief Incumbent of the Kataragama Kirivehera Rajamaha Viharaya, Ven. Kobawaka Damminda Thera and another monk were hospitalised last night after being shot by unidentified gunme..."], "date": [" June 13, 2018 11:18 am"], "comments": ["Comments - 0 / views : 121 ", " "], "title": ["Kirivehera Chief Incumbent injured in shooting"]},
{"newsitem": ["\r\n\tFollowing the devastating floods and landslides which have struck Sri Lanka over the last weeks, the European Commission gave €160 000 (approximately Rs 29 million) in huma..."], "date": [" June 12, 2018 04:37 pm"], "comments": ["Comments - 0 / views : 83 ", " "], "title": ["EU provides emergency relief to flood victims in Sri Lanka"]},
{"newsitem": ["\r\n\tA Sri Lankan travel agent was arrested by Indian Police on Wednesday for allegedly trying to fly to Sri Lanka with three Bhutanese women. The women told cops that the accused ha..."], "date": [" June 15, 2018 10:38 am"], "comments": ["Comments - 1 / views : 358 ", " "], "title": ["Lankan travel agent arrested trying to ‘traffic’ three Bhutan women to Iraq"]},
{"newsitem": ["The conviction of a Buddhist monk who had threatened the well-known campaigner against enforced disappearances, Sandhya Eknaligoda, is a victory for human rights defenders in Sri L..."], "date": [" June 14, 2018 06:54 pm"], "comments": ["Comments - 0 / views : 179 ", " "], "title": ["Court verdict victory for human rights defenders; Amnesty"]},
{"newsitem": ["\r\n\tFollowing are scenes witnessed today at the Homagama Magistrate's Court, where Bodu Bala Sena (BBS) General Secretary Ven. Galagoda Aththe Gnanasara Thera was sentenced to ..."], "date": [" June 14, 2018 04:12 pm"], "comments": ["Comments - 0 / views : 258 ", " "], "title": ["In Pictures: Gnanasara Thera sentenced to prison"]},
{"newsitem": ["\r\n\tYashoda Range Bandara, son of State Minister Palitha Range Bandara, was today granted bail by the Chilaw Magistrate's Court over a traffic accident caused while allegedly u..."], "date": [" June 14, 2018 03:32 pm"], "comments": ["Comments - 0 / views : 76 ", " "], "title": ["Range Bandara's son granted bail"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSpecial discounts up to 70 per cent will be offered to customers on globally renowned mobile phones brands and accessories during the Mobile Week commencing on Ju..."], "date": [" June 14, 2018 02:08 pm"], "comments": ["Comments - 1 / views : 295 ", " "], "title": ["Largest SL online sale of discounted mobile phones on June 18-30"]},
{"newsitem": ["\r\n\tBodu Bala Sena (BBS) General Secretary Ven. Galagoda Aththe Gnanasara Thera was today sentenced to one year Rigorous Imprisonment to be ended in six months by the Homagama Magis..."], "date": [" June 14, 2018 12:52 pm"], "comments": ["Comments - 1 / views : 245 ", " "], "title": ["Gnanasara Thera sentenced to 6 months in prison"]},
{"newsitem": ["\r\n\tTwo fishermen who distressed in the seas off Trincomalee due to an engine failure of their trawler, were rescued by Sri Lanka Naval Ship ‘Sayurala’ attached to North..."], "date": [" June 14, 2018 12:05 pm"], "comments": ["Comments - 0 / views : 46 ", " "], "title": ["Navy rescues two fishermen distressed in sea"]},
{"newsitem": ["\r\n\tA group of family members of missing persons held a protest in Trincomalee town yesterday (13) when members of the Office of Missing Persons (OMP) arrived for consultations.&nbs..."], "date": [" June 14, 2018 11:59 am"], "comments": ["Comments - 0 / views : 55 ", " "], "title": ["Some Trinco families boycott consultations with OMP"]},
{"newsitem": ["\r\n\tThe US Government’s Millennium Challenge Corporation (MCC) Managing Director for Europe, Asia, Pacific, and Latin America Caroline Nguyen visited Sri Lanka from June 11 to..."], "date": [" June 14, 2018 11:48 am"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Millennium Challenge Corporation official visits Sri Lanka to continue progress on compact development"]},
{"newsitem": ["\r\n\tChief Incumbent of the Kataragama Kirivehera Rajamaha Viharaya, Ven. Kobawaka Damminda Thera, who was injured in a shooting incident was admitted to a private hospital in Colomb..."], "date": [" June 14, 2018 11:35 am"], "comments": ["Comments - 0 / views : 76 ", " "], "title": ["Injured Damminda Thera airlifted to Colombo"]},
{"newsitem": ["\r\n\tThe Government has gazette regulations dated June 14 to set up the Amaradeva Aesthetic and Research Centre at Battaramulla in memory of the late Pandit W.D. Amaradeva.\r\n\tThe leg..."], "date": [" June 16, 2018 10:01 am"], "comments": ["Comments - 0 / views : 75 ", " "], "title": ["Bill to set up Amaradeva Centre gazetted"]},
{"newsitem": ["\r\n\t\r\n\tHigh-rise buildings in Colombo earlier were confined to 5 to 10 stories but now many exceed even 50 stories, now, which mean the maintenance of the high-rise building is crit..."], "date": [" June 15, 2018 02:08 pm"], "comments": ["Comments - 0 / views : 277 ", " "], "title": ["New facilities’ managers emerge as high-rise buildings increase"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSpecial discounts up to 70 per cent will be offered to customers on globally renowned mobile phones brands and accessories during the Mobile Week commencing on Ju..."], "date": [" June 14, 2018 02:08 pm"], "comments": ["Comments - 1 / views : 295 ", " "], "title": ["Largest SL online sale of discounted mobile phones on June 18-30"]},
{"newsitem": ["\r\n\tRumble in the Jungle, an adventure-themed off-road bicycle race being held currently in Sri Lanka, was suspended on Wednesday after a rider went missing, the national carrier sa..."], "date": [" June 13, 2018 07:08 pm"], "comments": ["Comments - 0 / views : 150 ", " "], "title": ["SriLankan Airlines adventure event suspended after one rider went missing"]},
{"newsitem": ["\r\n\tA new Sri Lankan balm that soothe aches and pain of sufferers from ailments such as back ache, muscular aches, sprains, cramps and insect bites will soon be available in the loc..."], "date": [" June 12, 2018 02:23 pm"], "comments": ["Comments - 0 / views : 156 ", " "], "title": ["New Lankan balm to relieve pain"]},
{"newsitem": ["\r\n\t\r\n\tDr Dayan Jayatilleke, former diplomat and regular political commentator, has been appointed Sri Lanka’s next ambassador to Russia, according to a newspaper announcement..."], "date": [" June 12, 2018 12:21 pm"], "comments": ["Comments - 0 / views : 255 ", " "], "title": ["Dayan, Sri Lanka’s new ambassador to Russia"]},
{"newsitem": ["\r\n\t\r\n\t\r\n\tSri Lanka is fast losing its economic sovereignty and the government’s position at the UN Human Rights Council and declarations reveal that Sri Lanka no longer enjoy..."], "date": [" June 07, 2018 10:06 am"], "comments": ["Comments - 1 / views : 559 ", " "], "title": ["Lankan think-tanks controlled by US, alleges former Lankan ambassador"]},
{"newsitem": ["\r\n\t\r\n\tD M N P Karunapala, CEO at Merchant Bank of Sri Lanka & Finance (MBSL), has been interdicted with effect from May 11 pending an inquiry, the Colombo Stock Exchange (CSE) ..."], "date": [" June 05, 2018 04:17 pm"], "comments": ["Comments - 0 / views : 638 ", " "], "title": ["MBSL CEO interdicted"]},
{"newsitem": ["\r\n\t\r\n\tDehan Seneviratne, a veteran marketing industry personality, has been appointed as Chairman, Sri Lanka Tourism Promotion Bureau (SLT[B) with effect from June 4. \r\n\r\n\r\n\r\n..."], "date": [" June 04, 2018 04:56 pm"], "comments": ["Comments - 0 / views : 165 ", " "], "title": ["Dehan Seneviratne, new chairman at Sri Lanka Tourism Promotion Bureau (SLTPB)"]},
{"newsitem": ["\r\n\tSri Lanka will play host to the International Housekeepers' Summit next month bringing together a number of Asian nations to share experiences and resolve challenges in ser..."], "date": [" June 04, 2018 01:38 pm"], "comments": ["Comments - 0 / views : 106 ", " "], "title": ["Asian Housekeepers' Summit in Colombo next month"]},
{"newsitem": ["\r\n\t\r\n\tThe redacted portions of the Commission of Inquiry report into the Central Bank bond scam will remain in the custody of Parliament Secretary General Dhammika Dassanayake.\r\n\r\n..."], "date": [" June 11, 2018 12:21 pm"], "comments": ["Comments - 0 / views : 82 ", " "], "title": ["Bond report: MPs to get redacted portions after Presidential Secretary returns"]},
{"newsitem": ["\r\n\tFormer Sports Minister and UPFA Parliamentarian Dayasiri Jayasekara arrived at the Crimes Investigation Division (CID) a short while ago.\r\n\r\n\r\n\r\n\tHe was summoned by the CID to r..."], "date": [" June 11, 2018 11:57 am"], "comments": ["Comments - 0 / views : 84 ", " "], "title": ["Former Sports Minister Dayasiri Jayasekara arrives at the CID"]},
{"newsitem": ["\r\n\t\r\n\tPresident Maithripala Sirisena had to intervene to settle a verbal duel between two ministers at last Tuesday’s ministerial meeting.\r\n\tIt was Rishad Bathiudeen who rais..."], "date": [" June 11, 2018 11:49 am"], "comments": ["Comments - 0 / views : 190 ", " "], "title": ["President settles clash between ministers"]},
{"newsitem": ["\r\n\t\r\n\tPresident Maithripala Sirisena has extended the term of Sri Lanka Air Force Commander Kapila Jayampathy.\r\n\tHe was to have retired on May 25 this year.\r\n\tAs a result, Air Mars..."], "date": [" June 11, 2018 11:43 am"], "comments": ["Comments - 0 / views : 93 ", " "], "title": ["SLAF chief gets extension"]},
{"newsitem": ["\r\n\tTwo alleged gangsters linked to underworld leaders 'Makandure Madush' and 'Angoda Lokka' were killed in a shootout with the Police Special Task Force (STF) t..."], "date": [" June 09, 2018 06:35 pm"], "comments": ["Comments - 1 / views : 448 ", " "], "title": ["Two underworld gangsters killed in shootout with STF"]},
{"newsitem": ["\r\n\tRenowned novelist, script writer and journalist Somaweera Senanayake has passed away at the age of 74. \r\n\r\n\r\n\r\n\tMr Senanayake was best remembered as a teledrama script writ..."], "date": [" June 09, 2018 06:08 pm"], "comments": ["Comments - 0 / views : 317 ", " "], "title": ["Renowned script writer Somaweera Senanayake passes away"]},
{"newsitem": ["\r\n\tPresident Maithripala Sirisena hosted an Ifthar ceremony at President's House last evening (7) for Islamic devotees observing the daily Ramadan fast.\r\n\r\n\r\n\r\n\tThe event was ..."], "date": [" June 08, 2018 11:59 am"], "comments": ["Comments - 1 / views : 235 ", " "], "title": ["President hosts Ifthar ceremony"]},
{"newsitem": ["\r\n\tArea residents in the Kalpitiya Peninsula have blocked the access road into the Lakvijaya Coal Power Plant in Norochcholai this morning (8) in protest at continued power outages..."], "date": [" June 08, 2018 11:23 am"], "comments": ["Comments - 0 / views : 222 ", " "], "title": ["Protesters block roads into Norochcholai power plant"]},
{"newsitem": ["\r\n\tState Minister Ranga Bandara's son Yashodha Bandara whose vehicle skidded off the road and plunged into a house in Chilaw on Wednesday was arrested.\r\n\r\n\r\n\r\n\tHe is alleg..."], "date": [" June 08, 2018 10:26 am"], "comments": ["Comments - 0 / views : 216 ", " "], "title": ["Minister Ranga Bandara's son arrested"]},
{"newsitem": ["\r\n\tParliament website and mobile app began providing  the facility to listen to simultaneous interpretation of parliamentary speeches while watching or listening “P..."], "date": [" June 08, 2018 09:51 am"], "comments": ["Comments - 0 / views : 132 ", " "], "title": ["Parliament ´Live´with simultaneous interpretation"]},
{"newsitem": ["\r\n\tA television network owned by the family of Sri Lankan Prime Minister Ranil Wickremesinghe was suspended by the island's telecom regulator Tuesday, worsening a power struggl..."], "date": [" June 06, 2018 10:15 am"], "comments": ["Comments - 0 / views : 127 ", " "], "title": ["TRC shuts TV network linked to Prime Minister's brother"]},
{"newsitem": ["\r\n\tUnited National Party (UNP) Monaragala District MP Ananda Kumarasiri was elected as the new Deputy Speaker of Parliament a short while ago after a secret vote. \r\n\r\n\r\n\r\n\tMr ..."], "date": [" June 05, 2018 05:40 pm"], "comments": ["Comments - 0 / views : 102 ", " "], "title": ["UNP's Ananda Kumarasiri elected new Deputy Speaker"]},
{"newsitem": ["\r\n\t\r\n\tD M N P Karunapala, CEO at Merchant Bank of Sri Lanka & Finance (MBSL), has been interdicted with effect from May 11 pending an inquiry, the Colombo Stock Exchange (CSE) ..."], "date": [" June 05, 2018 04:17 pm"], "comments": ["Comments - 0 / views : 638 ", " "], "title": ["MBSL CEO interdicted"]},
{"newsitem": ["\r\n\tTwo names have been proposed for the post of Deputy Speaker of Parliament. The United National Party (UNP) has proposed the name of Monaragala District MP Ananda Kumarasiri. The..."], "date": [" June 05, 2018 03:08 pm"], "comments": ["Comments - 0 / views : 95 ", " "], "title": ["Two names proposed for Deputy Speaker: Secret vote to be held"]},
{"newsitem": ["\r\n\tSpeaker Karu Jayasuriya today informed Parliament that he had only he had so far only received a small portion of the Bond Commission's report and as such, they would ..."], "date": [" June 05, 2018 02:54 pm"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["Not all sections of Bond report received - Speaker"]},
{"newsitem": ["\r\n\tMinister Mangala Samaraweera has been appointed as the Vice Chairman of the United National Party (UNP). \r\n\r\n\r\n\r\n\tMinister Samaraweera's appointment is part of reorgan..."], "date": [" June 05, 2018 02:43 pm"], "comments": ["Comments - 0 / views : 74 ", " "], "title": ["Mangala appointed UNP Vice Chairman"]},
{"newsitem": ["\r\n\tVeteran journalist and TV presenter Hema Nalin Karunaratne has passed away. He had passed away earlier today (5) at his home. \r\n\r\n\r\n\r\n\tHe was 55 years at the time of his de..."], "date": [" June 05, 2018 02:30 pm"], "comments": ["Comments - 1 / views : 5266 ", " "], "title": ["Veteran journalist Hema Nalin no more"]},
{"newsitem": ["\r\n\tCommuters will benefit immensely while the National Transport Commission (NTC) will lose millions from July 1, 2018 onwards when Super Luxury buses plying between..."], "date": [" June 05, 2018 02:07 pm"], "comments": ["Comments - 0 / views : 164 ", " "], "title": ["Super luxury highway bus fare to be reduced"]},
{"newsitem": ["\r\n\tA 29-year-old police constable was killed after a collision between a motorbike and a lorry on the Galle-Colombo Main Road in Beruwala yesterday (3). \r\n\r\n\r\n\r\n\tThe deceased ..."], "date": [" June 05, 2018 12:31 pm"], "comments": ["Comments - 0 / views : 75 ", " "], "title": ["Police Constable killed in accident"]},
{"newsitem": ["\r\n\tSections C350 and C360 of the report of the Presidential Commission of Inquiry into the Treasury Bond,which were previously not released, have been handed over to the Speaker of..."], "date": [" June 05, 2018 12:05 pm"], "comments": ["Comments - 0 / views : 47 ", " "], "title": ["Unreleased sections of Bond Commission report handed over to Speaker"]},
{"newsitem": ["\r\n\tOman Post has announced that it will temporarily stop receiving any mail to be sent to Sri Lanka, \"due to unforeseen circumstances\".\r\n\r\n\r\n\r\n\tIn a statement online, the..."], "date": [" June 19, 2018 08:49 pm"], "comments": ["Comments - 0 / views : 8 ", " "], "title": ["Oman Post suspend services to Sri Lanka as indefinite strike continues"]},
{"newsitem": ["\r\n\tFive suspects were taken into custody along with 13.4 kilograms of a version of Ganja known as 'Maava' by Mundalama Police. \r\n\r\n\r\n\r\n\tThe suspects were arrested an..."], "date": [" June 19, 2018 03:09 pm"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["Police bust 'Maava' drug ring in Puttalam"]},
{"newsitem": ["\r\n\tA Police Sergeant was killed and a Constable injured after they were struck by a speeding motor car at Nildiya Uyana in Matale. \r\n\r\n\r\n\r\n\tThe officers, who are attached to t..."], "date": [" June 19, 2018 02:36 pm"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["Police Sergeant killed by speeding vehicle"]},
{"newsitem": ["\r\n\tHungama Police have arrested an individual who had been evading courts for 15 years after being sentenced to four years Rigorous Imprisonment (RI) after being convicted of rape ..."], "date": [" June 19, 2018 01:52 pm"], "comments": ["Comments - 0 / views : 36 ", " "], "title": ["Accused in rape case nabbed after absconding for 15 years"]},
{"newsitem": ["\r\n\tPolice have used tear gas and water cannon to disperse a protest march conducted by university students near Parliament premises in Battaramulla a short while ago. \r\n\r\n\r\n\r\n..."], "date": [" June 19, 2018 01:26 pm"], "comments": ["Comments - 0 / views : 67 ", " "], "title": ["Anti-SAITM protest near Parliament tear gassed"]},
{"newsitem": ["\r\n\tA Sathyagraha was held opposite the Colombo Fort Railway Station yesterday calling for the release of Bodu Bala Sena (BBS) General Secretary Ven. Galagodaaththe Gnanasara Thera...."], "date": [" June 19, 2018 12:54 pm"], "comments": ["Comments - 0 / views : 36 ", " "], "title": ["Sathyagraha held calling for release of Gnanasara Thera"]},
{"newsitem": ["\r\n\tThe naval ships ‘Dixmude’ and ‘Surcouf’ belonging to the French Navy arrived at the port of Colombo yesterday on a goodwill visit, Navy said. The ships w..."], "date": [" June 19, 2018 12:28 pm"], "comments": ["Comments - 0 / views : 49 ", " "], "title": ["Two French naval ships arrive at Colombo port"]},
{"newsitem": ["\r\n\tPostal employees held a protest in Colombo yesterday (18) demanding the Government address their demands, which has led to a continuous island-wide postal strike. \r\n\r\n\r\n\r\n\t..."], "date": [" June 19, 2018 12:23 pm"], "comments": ["Comments - 0 / views : 30 ", " "], "title": ["In Pictures: Postal workers protest in Colombo"]},
{"newsitem": ["\r\n\tSri Lanka Army Headquarters requested public from aiding or abetting Army deserters, harbouring or using them for any anti-social acts since it is a punishable offence according..."], "date": [" June 19, 2018 12:20 pm"], "comments": ["Comments - 0 / views : 14 ", " "], "title": ["Harbouring of Army Absentees is a punishable offence; Army"]},
{"newsitem": ["\r\n\tPresident Maithripala Sirisena's former Chief of Staff, Dr I.H.K. Mahanama and former State Timber Corporation (STC) Chairman P. Dissanayake were today further remanded unt..."], "date": [" June 19, 2018 12:05 pm"], "comments": ["Comments - 0 / views : 25 ", " "], "title": ["President's former Chief of Staff and former Timber Corp. Chairman further remanded"]},
{"newsitem": ["\r\n\tThe Homagama Magistrate's Court today postponed the hearing of the appeal of Bodu Bala Sena (BBS) General Secretary Ven. Galagoda Aththe Gnanasara Thera until 2.0..."], "date": [" June 19, 2018 11:48 am"], "comments": ["Comments - 0 / views : 32 ", " "], "title": ["Hearing of Gnanasara Thera's appeal postponed"]},
{"newsitem": ["\r\n\tThe road  towards Maradana on D.R. Wijewardena Mawatha is currently congested due to a protest by Postal workers.\r\n\r\n\r\n\r\n\tThe protest is being held near the Central Mail ex..."], "date": [" June 18, 2018 11:51 am"], "comments": ["Comments - 0 / views : 60 ", " "], "title": ["Postal workers’ protest near Central Mail Exchange"]},
{"newsitem": ["\r\n\tThe Government has decided that the Secretaries to Ministries, Heads of Departments, Chairpersons, executive officers and Accountants of Government Institutions should take the ..."], "date": [" June 18, 2018 11:49 am"], "comments": ["Comments - 1 / views : 96 ", " "], "title": ["Heads of State Institutions responsible for paying salaries to excess staff"]},
{"newsitem": ["\r\n\tSriLankan Airlines has informed all passengers to arrive at the airport four hours early prior to departure due to a series of renovation work expected to commence today at the ..."], "date": [" June 18, 2018 10:56 am"], "comments": ["Comments - 0 / views : 235 ", " "], "title": ["Passengers  to arrive 4 hours before departure at BIA"]},
{"newsitem": ["\r\n\tThe Government has gazette regulations dated June 14 to set up the Amaradeva Aesthetic and Research Centre at Battaramulla in memory of the late Pandit W.D. Amaradeva.\r\n\tThe leg..."], "date": [" June 16, 2018 10:01 am"], "comments": ["Comments - 0 / views : 75 ", " "], "title": ["Bill to set up Amaradeva Centre gazetted"]},
{"newsitem": ["\r\n\tTwo out of five students who went to bathe in the sea at Etukala in Negombo are reported missing. \r\n\r\n\r\n\r\n\tTwo of the students who got into difficulty were rescued by fishe..."], "date": [" June 15, 2018 06:02 pm"], "comments": ["Comments - 0 / views : 106 ", " "], "title": ["Two students bathing in sea reported missing"]},
{"newsitem": ["\r\n\tThe main suspect in the assassination of the Deputy Chairman of the Karandeniya Pradeshiya Sabha, Donald Sampath, has been arrested. \r\n\r\n\r\n\r\n\tThe arrested suspect is report..."], "date": [" June 15, 2018 04:14 pm"], "comments": ["Comments - 0 / views : 61 ", " "], "title": ["Main suspect in Karandeniya PS Deputy Chairman's killing arrested"]},
{"newsitem": ["\r\n\tPresident Maithripala Sirisena attended religious observances at St. Anne's Church in Thalawila on Wednesday evening. \r\n\r\n\r\n\r\n\tA book published to mark the 250th anniv..."], "date": [" June 15, 2018 03:29 pm"], "comments": ["Comments - 0 / views : 145 ", " "], "title": ["President visits Thalawila St. Anne's Church"]},
{"newsitem": ["\r\n\t\r\n\tHigh-rise buildings in Colombo earlier were confined to 5 to 10 stories but now many exceed even 50 stories, now, which mean the maintenance of the high-rise building is crit..."], "date": [" June 15, 2018 02:08 pm"], "comments": ["Comments - 0 / views : 277 ", " "], "title": ["New facilities’ managers emerge as high-rise buildings increase"]},
{"newsitem": ["\r\n\tAn accomplice of underworld drug kingpin 'Wele Suda' has been arrested by the Police Narcotics Bureau along with 2 kilogramso of heroin. \r\n\r\n\r\n\r\n\tHe was taken int..."], "date": [" June 15, 2018 11:14 am"], "comments": ["Comments - 0 / views : 76 ", " "], "title": ["Accomplice of 'Wele Suda' nabbed with heroin"]},
{"newsitem": ["\r\n\tHeavy traffic has been reported from the Town Hall area due to a protest march by the Inter University Students' Federation (IUSF). \r\n\r\n\r\n\r\n\tMotorists are advised to u..."], "date": [" June 12, 2018 03:00 pm"], "comments": ["Comments - 0 / views : 67 ", " "], "title": ["Heavy traffic in Town Hall"]},
{"newsitem": ["\r\n\tThough a continuous island-wide postal strike is now in effect, employees at the Ambalantota Post Office are continuing to work as usual. \r\n\r\n\r\n\r\n\tNine sub post offices tha..."], "date": [" June 12, 2018 02:29 pm"], "comments": ["Comments - 0 / views : 168 ", " "], "title": ["Ambalantota post offices working despite strike"]},
{"newsitem": ["\r\n\tA new Sri Lankan balm that soothe aches and pain of sufferers from ailments such as back ache, muscular aches, sprains, cramps and insect bites will soon be available in the loc..."], "date": [" June 12, 2018 02:23 pm"], "comments": ["Comments - 0 / views : 156 ", " "], "title": ["New Lankan balm to relieve pain"]},
{"newsitem": ["\r\n\tCabinet has granted approval to reduce the price of kerosene to Rs.70 per litre. Minister of Fisheries and Aquatic Resources Development, Vijith Wijayamuni Zoysa had submitted t..."], "date": [" June 12, 2018 01:59 pm"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Cabinet approval given to reduce kerosene price"]},
{"newsitem": ["\r\n\tSri Lanka is making steady progress towards the goal of mine free status and remains hopeful of completing mine action by 2020, Sri Lanka Permanent Representative to the United ..."], "date": [" June 12, 2018 01:53 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["Sri Lanka to complete mine action and reaching mine-free status by 2020"]},
{"newsitem": ["\r\n\tState Minister Palitha Range Bandara's son, Yashoda Range Bandara who was arrested over a traffic accident, was today ordered further remanded in custody till June 14 by th..."], "date": [" June 12, 2018 01:32 pm"], "comments": ["Comments - 0 / views : 36 ", " "], "title": ["Range Bandara's son further remanded"]},
{"newsitem": ["\r\n\tThe Matara Journalists' Association recently carried out a programme to distribute face masks to members of the public coming to see patients at the Matara General Hospital..."], "date": [" June 12, 2018 12:52 pm"], "comments": ["Comments - 0 / views : 42 ", " "], "title": ["Matara journalists distribute face masks to protect against viral fever"]},
{"newsitem": ["\r\n\t\r\n\tDr Dayan Jayatilleke, former diplomat and regular political commentator, has been appointed Sri Lanka’s next ambassador to Russia, according to a newspaper announcement..."], "date": [" June 12, 2018 12:21 pm"], "comments": ["Comments - 0 / views : 255 ", " "], "title": ["Dayan, Sri Lanka’s new ambassador to Russia"]},
{"newsitem": ["\r\n\tThe Civil Security Department's (CSD) Commanding Officer in Mullaitivu, Kilinochchi and Jaffna, Colonel Rathnapriya Bandu was given an emotional send-off yesterday (11) by ..."], "date": [" June 12, 2018 12:05 pm"], "comments": ["Comments - 1 / views : 297 ", " "], "title": ["Rehabilitated LTTE cadres give tearful farewell to departing officer"]},
{"newsitem": ["\r\n\tTwo new State Ministers and five  Deputy Ministers were sworn in before President Maithripala Sirisena at the Presidential Secretariat, today (June 12).\r\n\r\n\r\n\r\n\tAccording t..."], "date": [" June 12, 2018 11:12 am"], "comments": ["Comments - 0 / views : 79 ", " "], "title": ["New State Ministers and  Deputy Ministers sworn"]},
{"newsitem": ["\r\n\tThe Sri Lanka Freedom Party (SLFP) is gearing up to revamp the party machinery from down to top to win the confidence of masses by giving grassroot level leadership for politica..."], "date": [" June 04, 2018 12:44 pm"], "comments": ["Comments - 0 / views : 72 ", " "], "title": ["SLFP to be revamped with common man’s party ideology   "]},
{"newsitem": ["\r\n\t\r\n\tInvestment flows from the Scandinavian region to the Sri Lankan stock market have made a noteworthy improvement in recent years, where inward investments have grown by 39 per..."], "date": [" May 29, 2018 03:13 pm"], "comments": ["Comments - 0 / views : 152 ", " "], "title": ["Sri Lankan equities attracts wider international audience-CSE"]},
{"newsitem": ["\r\n\t\r\n\tChevron Lubricants Lanka PLC’s long-standing Managing  Director/CEO Kishu Gomes has resigned from the company with immediate effect. In the announcement on We..."], "date": [" May 23, 2018 09:31 am"], "comments": ["Comments - 2 / views : 1579 ", " "], "title": ["Chevron Lubricants Lanka MD/CEO Kishu Gomes resigns"]},
{"newsitem": ["\r\n\t\r\n\tWhile advertising plays a significant role in building a brand’s success, bringing out the qualitative and quantitative ideas to real life makes it exceptional, to stan..."], "date": [" May 23, 2018 09:11 am"], "comments": ["Comments - 0 / views : 43 ", " "], "title": ["Bringing quality ideas to real life is about winning an Effie award "]},
{"newsitem": ["\r\n\tSLT Rainbow Pages National Business Directory (Western Province) 2018/19 is now being published annually instead of once in two years, Chief Executive Officer of the SLT Digital..."], "date": [" May 23, 2018 09:04 am"], "comments": ["Comments - 0 / views : 80 ", " "], "title": ["SLT Rainbow Pages National Business Directory now comes out annually "]},
{"newsitem": ["\r\n\tAlthough there are more educated women than men in Sri Lanka, this development impacts on the economy and when that happens, it’s the women who eventually suffer, accordin..."], "date": [" May 23, 2018 08:57 am"], "comments": ["Comments - 0 / views : 251 ", " "], "title": ["Education: Women dominate in Sri Lankan universities over men"]},
{"newsitem": ["\r\n\tAitken Spence PLC recorded a steady financial performance for the financial year ending March 2018 with a 22 per cent year-on-year growth in profit-before-tax to Rs. 6.4 billion..."], "date": [" May 22, 2018 04:57 pm"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Aitken Spence posts 22 % growth in pre-tax profit for 2017/18"]},
{"newsitem": ["\r\n\tBuilding on a strong momentum gathered over the final quarter of FY 2017/18, Sri Lanka’s leading diversified conglomerate, Hayleys PLC says it ended the year with “a..."], "date": [" May 21, 2018 03:54 pm"], "comments": ["Comments - 0 / views : 131 ", " "], "title": ["Hayleys Group crosses US$ 1 bn turnover in FY2017/18"]},
{"newsitem": ["\r\n\t\r\n\tSri Lanka achieved peace due to the great sacrifices made by the war heroes in the armed forces, going to the extent of sacrificing their own lives, a top Minister said on Fr..."], "date": [" May 19, 2018 10:17 am"], "comments": ["Comments - 0 / views : 122 ", " "], "title": ["Sri Lankan security forces made great sacrifices in the march to peace: Minister"]},
{"newsitem": ["\r\n\tBandaranaike International Airport (BIA) operations returned to normal about an hour back (at 3 pm on Friday) following the intervention of Minister S.B. Navinna after passenger..."], "date": [" May 18, 2018 04:42 pm"], "comments": ["Comments - 0 / views : 116 ", " "], "title": ["BIA immigration officers call off strike"]},
{"newsitem": ["\r\n\tA new Deputy Speaker of Parliament will be elected on June 5 when the House next meets.\r\n\r\n\r\n\r\n\tThilanga Sumathipala has resigned from the post of Deputy Speaker and Chairperson..."], "date": [" June 01, 2018 01:46 pm"], "comments": ["Comments - 0 / views : 132 ", " "], "title": ["New Deputy Speaker to be appointed on June 5"]},
{"newsitem": ["\r\n\tLahore’s Safari Park is to receive two Sri Lankan elephants  likely to arrive next month. The elephants that were purchased for Lahore Zoo are expected to a..."], "date": [" June 01, 2018 01:36 pm"], "comments": ["Comments - 0 / views : 145 ", " "], "title": ["Lahore's Safari Park to get two Sri Lankan elephants"]},
{"newsitem": ["\r\n\tThe new map of Colombo was presented  to the Minister of Lands and Parliamentary Reforms Gayantha Karunathilaka by the Survey General of Sri Lanka P.M.P. Udayakan..."], "date": [" June 01, 2018 01:01 pm"], "comments": ["Comments - 0 / views : 290 ", " "], "title": ["In pictures: New map of Colombo city"]},
{"newsitem": ["\r\n\tThe Colombo Chief Magistrate has issued warrants for the arrest of Eastern Province Governor and former Minister Rohitha Bogollagama's wife and daughter.\r\n\r\n\r\n\r\n\tThe warran..."], "date": [" June 01, 2018 12:06 pm"], "comments": ["Comments - 0 / views : 310 ", " "], "title": ["Court orders arrest of Rohitha Bogollagama's wife and daughter"]},
{"newsitem": ["\r\n\tUnited People's Freedom Alliance (UPFA) Puttalam District Parliamentarian Sanath Nishantha was granted bail by the Chilaw High Court today (31). \r\n\r\n\r\n\r\n\tHowever, his ..."], "date": [" May 31, 2018 01:06 pm"], "comments": ["Comments - 0 / views : 70 ", " "], "title": ["MP Sanath Nishantha released on bail"]},
{"newsitem": ["\r\n\t\r\n\tDehan Seneviratne, a veteran marketing industry personality, has been appointed as Chairman, Sri Lanka Tourism Promotion Bureau (SLT[B) with effect from June 4. \r\n\r\n\r\n\r\n..."], "date": [" June 04, 2018 04:56 pm"], "comments": ["Comments - 0 / views : 165 ", " "], "title": ["Dehan Seneviratne, new chairman at Sri Lanka Tourism Promotion Bureau (SLTPB)"]},
{"newsitem": ["\r\n\tThe wife and daughter of Eastern Province Governor Rohitha Bogollagama were granted bail by the Colombo Chief magistrate.\r\n\r\n\r\n\r\n\tThe mother and daughter surrendered before the ..."], "date": [" June 04, 2018 01:49 pm"], "comments": ["Comments - 1 / views : 289 ", " "], "title": ["Rohitha Bogollagama daughter and wife granted bail"]},
{"newsitem": ["\r\n\tSri Lanka will play host to the International Housekeepers' Summit next month bringing together a number of Asian nations to share experiences and resolve challenges in ser..."], "date": [" June 04, 2018 01:38 pm"], "comments": ["Comments - 0 / views : 106 ", " "], "title": ["Asian Housekeepers' Summit in Colombo next month"]},
{"newsitem": ["\r\n\tThe Sri Lanka Freedom Party (SLFP) is gearing up to revamp the party machinery from down to top to win the confidence of masses by giving grassroot level leadership for politica..."], "date": [" June 04, 2018 12:44 pm"], "comments": ["Comments - 0 / views : 72 ", " "], "title": ["SLFP to be revamped with common man’s party ideology   "]},
{"newsitem": ["\r\n\tA 48-hour trade union action was begun by Postal employees including post masters island-wide from midnight yesterday.\r\n\r\n\r\n\r\n\tThe decision was reached based on several issues i..."], "date": [" June 04, 2018 11:26 am"], "comments": ["Comments - 0 / views : 308 ", " "], "title": ["48-hour strike by postal employees"]},
{"newsitem": ["\r\n\t Sri Lanka on Wednesday signed an agreement with a subsidiary of U.S. firm Schlumberger for a $50 million seismic study off the country’s east coast to evaluate any p..."], "date": [" May 31, 2018 12:30 pm"], "comments": ["Comments - 0 / views : 185 ", " "], "title": ["Sri Lanka signs deal with Schlumberger subsidiary for $50 million seismic study"]},
{"newsitem": ["\r\n\tRailway technical unions have decided to end their 48-hour token strike at 4.00pm today (31). \r\n\r\n\r\n\r\n\tThe strike was launched at 4.00pm on Tuesday (29) by railway technica..."], "date": [" May 31, 2018 12:14 pm"], "comments": ["Comments - 0 / views : 81 ", " "], "title": ["Railway technical staff to end strike today"]},
{"newsitem": ["\r\n\tAll casual, assigned and contract railway technical workers who do not report to work by 12 noon today (31) will be treated as having vacated their posts, Sri Lanka Railways sai..."], "date": [" May 31, 2018 11:15 am"], "comments": ["Comments - 0 / views : 67 ", " "], "title": ["Railways issues ultimatum to striking workers"]},
{"newsitem": ["\r\n\tFormer Director of Military Intelligence, Major General (Retired) Amal Karunasekara was today further remanded in custody until June 13 by the Mount Lavinia Magistrate's Co..."], "date": [" May 30, 2018 03:05 pm"], "comments": ["Comments - 0 / views : 84 ", " "], "title": ["Former Military Intelligence Director further remanded"]},
{"newsitem": ["\r\n\tThe SLFP's Executive Council and All Island Committee yesterday appointed a new set of office-bearers to handle future party activities.\r\n\r\n\r\n\r\n\tAccording to a statemen..."], "date": [" June 04, 2018 10:00 am"], "comments": ["Comments - 0 / views : 112 ", " "], "title": ["New SLFP office-bearers appointed;  Chandrika, Mahinda and D.M. appointed to Party Advisory Committee"]},
{"newsitem": ["\r\n\tThe International Monetary Fund announced the release of the latest instalment of Sri Lanka's $1.5 billion bailout on Saturday, but warned that restructuring the loss-making..."], "date": [" June 03, 2018 06:33 pm"], "comments": ["Comments - 0 / views : 202 ", " "], "title": ["IMF releases $250 mn of Sri Lanka loan, seeks airline shake-up"]},
{"newsitem": ["\r\n\t\r\n\tA number of Sri Lanka Foreign Service career officers are in for new diplomatic postings, according to preparations now under way. In the running to take over as Sri Lanka&rs..."], "date": [" June 03, 2018 06:29 pm"], "comments": ["Comments - 0 / views : 301 ", " "], "title": ["Top postings for career diplomats"]},
{"newsitem": ["\r\n\t\r\n\tIt was some three hours before dawn when the circulation manager of a Jaffna-based Tamil newspaper began to panic.\r\n\tThe delivery boy for the town area had not arrived. A fur..."], "date": [" June 03, 2018 06:27 pm"], "comments": ["Comments - 0 / views : 195 ", " "], "title": ["Brutal attack on Jaffna newspaper circulation manager"]},
{"newsitem": ["\r\n\t\r\n\tThe Alliance of Unions of SriLankan Airlines has asked the airline management to make available to it plans submitted by the British firm Nyras for restructuring the national..."], "date": [" June 03, 2018 06:04 pm"], "comments": ["Comments - 0 / views : 132 ", " "], "title": ["Unions want SriLankan’s restructuring plan"]},
{"newsitem": ["\r\n\tA power failure has been reported from several areas, including Tangalle, Beliatta, Middeniya, Walasmulla, Suriyawewa and Hakmana. \r\n\r\n\r\n\r\n\tThe power failure has allegedly ..."], "date": [" May 30, 2018 12:09 pm"], "comments": ["Comments - 0 / views : 88 ", " "], "title": ["Power disrupted to several areas in Southern Province"]},
{"newsitem": ["\r\n\tImmigration officials are currently (as at 12 noon on Friday) said to be in talks with authorities concerning the strike action by its Colombo airport staff that has delayed pas..."], "date": [" May 18, 2018 01:15 pm"], "comments": ["Comments - 0 / views : 159 ", " "], "title": ["Immigration staff delays BIA"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSriLankan Airlines on Thursday urged all departing passengers, to arrive at the Colombo airport three hours prior to the departure time with effect from today (Ma..."], "date": [" May 17, 2018 11:52 am"], "comments": ["Comments - 0 / views : 485 ", " "], "title": ["Strike affects Colombo airport check-in"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\t \r\n\r\n\r\n\r\n\t\r\n\tHameedia, the reputed Sri Lanka’s menswear fashion store,  following the massive fire that broke out on May 12 at the company’s..."], "date": [" May 16, 2018 04:22 pm"], "comments": ["Comments - 0 / views : 251 ", " "], "title": ["Resilient Hameedia promises to rise from the ashes"]},
{"newsitem": ["\r\n\t\r\n\t\r\n\tHSBC and ING Bank have successfully executed, what is claimed to be the “first scalable live trade finance transaction using blockchain” for Cargill, an intern..."], "date": [" May 16, 2018 11:19 am"], "comments": ["Comments - 0 / views : 80 ", " "], "title": ["Groundbreaking HSBC blockchain transaction set to revolutionise trade "]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\t\r\n\tIn business – in the corporate world - the highest achievement a person could make is to be in the board-room and become its leader there. \r\n\tHoweve..."], "date": [" May 16, 2018 09:12 am"], "comments": ["Comments - 0 / views : 49 ", " "], "title": ["Obstacles for women to achieve board-room level excellence"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\t\r\n\tSmall and Medium Enterprise (SME) customers will benefit mostly following the launch of a new SME Business Card by the Hatton National Bank in partnership with..."], "date": [" May 11, 2018 04:44 pm"], "comments": ["Comments - 0 / views : 124 ", " "], "title": ["New SME business card from HNB"]},
{"newsitem": ["\r\n\t\r\n\tViber, the global messaging and voice app, says it has taken careful steps to ensure data remains secure and private, following a recent outcry over privacy options on social..."], "date": [" May 08, 2018 10:33 am"], "comments": ["Comments - 0 / views : 269 ", " "], "title": ["Viber assures Sri Lankan users of ‘more secure; stronger connections’"]},
{"newsitem": ["\r\n\t\r\n\tA variety of reasons caused delays to several SriLankan Airlines flights on May 3.\r\n\r\n\r\n\r\n\tThe untimely sickness of a passenger inbound from the Gulf initiated a diversion to..."], "date": [" May 03, 2018 06:26 pm"], "comments": ["Comments - 0 / views : 326 ", " "], "title": ["Flt delays at SriLankan Airlines on Thursday"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\t \r\n\r\n\r\n\r\n\tThe Planters’ Association of Ceylon (PA) has commended a Government decision to lift the ban on the importation of glyphosate-based weedicide..."], "date": [" May 02, 2018 07:24 pm"], "comments": ["Comments - 0 / views : 119 ", " "], "title": ["Lankan planters' hail decision to lift ban on glyphosate"]},
{"newsitem": ["\r\n\t\r\n\tPresident Maithripala Sirisena has ordered the suspension of the removal of unauthorised constructions on the coastal belt in Mirissa, Tourism Development Minister John Amara..."], "date": [" May 01, 2018 11:47 pm"], "comments": ["Comments - 0 / views : 205 ", " "], "title": ["President suspends removal of unauthorised constructions in Mirissa "]},
{"newsitem": ["\r\n\tSenior business professional Dinesh Weerakkody has been appointed chairman of Hatton National Bank (HNB) with effect from May 26.\r\n\tThis was announced by HNB on Tuesday. Mr. Wee..."], "date": [" May 01, 2018 11:07 am"], "comments": ["Comments - 0 / views : 656 ", " "], "title": ["Dinesh Weerakkody, new chairman of HNB; first to head two private banks in SL"]},
{"newsitem": ["\r\n\t\r\n\tThe merger between Hutchison Telecommunications Lanka (Pvt) Ltd and Etisalat Lanka (Pvt) Ltd is likely to relieve some competitive pressures that have undermined Sri Lankan t..."], "date": [" May 01, 2018 10:06 am"], "comments": ["Comments - 0 / views : 455 ", " "], "title": ["Hutch-Etisalat merger will ease competitive pressure: Fitch"]},
{"newsitem": ["\r\n\tRecent incidents like the horrifying deaths of five workers from ammonia inhalation at a Horana rubber factory and two others at a spices factory at Dambulla also due to poisono..."], "date": [" April 28, 2018 09:10 am"], "comments": ["Comments - 0 / views : 115 ", " "], "title": ["Accidents at Lankan factories from poisonous gases due to weak safety standards"]},
{"newsitem": ["\r\n\t\r\n\tSri Lanka’s economic grew by only 3.1 per cent last year, the lowest in 16 years with the fall blamed on mostly adverse weather conditions, according to Centr..."], "date": [" April 26, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 501 ", " "], "title": ["Sri Lanka’s economic growth in 2017 fell to 16 year-low"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tRanel T. Wijesinha, a well-known accountant and corporate director, has been appointed the new chairman of the Securities and Exchange Commission (SEC), informed ..."], "date": [" April 26, 2018 08:39 pm"], "comments": ["Comments - 0 / views : 190 ", " "], "title": ["Sri Lanka's stock market regulator gets a new chief"]},
{"newsitem": ["\r\n\tHong Kong -based CK Hutchison and UAE-basedEtisalat have agreed to merge their mobile businesses in Sri Lanka, operating under the names Hutch Lanka and Etisalat Lanka. The comp..."], "date": [" April 26, 2018 07:59 pm"], "comments": ["Comments - 0 / views : 693 ", " "], "title": ["Hutchison, Etisalat merge mobile operations in Sri Lanka"]},
{"newsitem": ["\r\n\t\r\n\tSri Lanka’s Tourism Development Minister John Amaratunga on Thursday raised concerns of interference in the implementation of the law by the relevant authorities in the..."], "date": [" April 26, 2018 07:34 pm"], "comments": ["Comments - 0 / views : 230 ", " "], "title": ["Two ministers: Accusations fly over Mirissa tourism fracas"]},
{"newsitem": ["\r\n\tRecent political developments in Sri Lanka have triggered uncertainty over reform momentum and fiscal consolidation while prolonged upheaval could undermine investor confidence ..."], "date": [" April 26, 2018 03:58 pm"], "comments": ["Comments - 0 / views : 117 ", " "], "title": ["Sri Lankan political unrest testing reforms:Fitch"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tThe potential for trade between Pakistan and Sri Lanka is somewhere between US$ 5 to $10 billion but based on the current annual achievement of just $350 million,..."], "date": [" April 26, 2018 03:42 pm"], "comments": ["Comments - 0 / views : 71 ", " "], "title": ["Huge potential to grow Pakistan- Sri Lanka trade to $5 bln from just $350 mln"]},
{"newsitem": ["\r\n\t\r\n\t \r\n\tThe government’s transparency in disclosing information on the progress of 2017 budget proposals has improved significantly although some ministries and state ..."], "date": [" April 25, 2018 05:44 pm"], "comments": ["Comments - 0 / views : 62 ", " "], "title": ["Almost a quarter of SL’s 2017 budget promises unfulfilled"]},
{"newsitem": ["\r\n\t\r\n\t \r\n\r\n\r\n\r\n\tSri Lanka’s Central Bank (CB) on Thursday suspended a March 31 deadline for the acceptance of willfully defaced currency notes saying these would be acce..."], "date": [" March 29, 2018 08:25 pm"], "comments": ["Comments - 0 / views : 146 ", " "], "title": ["SL Central Bank suspends March 31 deadline for defaced currency notes"]},
{"newsitem": ["\r\n\tCoca-Cola President meets PM, commits to contribute $50 mn by 2023 \r\n\r\n\r\n\r\n\tPresident/CEO of The Coca-Cola Company, James Quincey, met Prime Minister Ranil Wickremesinghe d..."], "date": [" March 29, 2018 02:09 pm"], "comments": ["Comments - 0 / views : 232 ", " "], "title": ["Coca-Cola President meets PM, commits to contribute $50 mn by 2023 "]},
{"newsitem": ["\r\n\t\r\n\tThe revamped website of the Central Bank of Sri Lanka (CB) was launched by Governor Dr. Indrajit Coomaraswamy on Wednesday.\r\n\tThe main features of the new site https://www.cb..."], "date": [" March 28, 2018 11:04 pm"], "comments": ["Comments - 0 / views : 95 ", " "], "title": ["Central Bank launches revamped website"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSri Lankan President Maithripala Sirisena, in a move that would further distance the partners in Sri Lanka’s troubled ruling coalition, on Wednesday removed..."], "date": [" March 28, 2018 07:53 pm"], "comments": ["Comments - 0 / views : 198 ", " "], "title": ["Central Bank removed from Prime Minister Wickremesinghe’s control"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tAn office titled the Delegation of German Industry and Commerce in Sri Lanka was opened in Colombo on Tuesday with Malik Samarawickrama, Minister of International..."], "date": [" March 28, 2018 01:02 pm"], "comments": ["Comments - 1 / views : 221 ", " "], "title": ["New German industry office opens in Colombo"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\t \r\n\r\n\r\n\r\n\tThe Ishara Nanayakkara family-led LOLC Group on Wednesday increased its stake in the company, buying over the 30 per cent stake held by Japan&rsquo..."], "date": [" March 28, 2018 10:43 am"], "comments": ["Comments - 0 / views : 1646 ", " "], "title": ["Nanayakkara family increases LOLC stake to 85 %, buying Japan's ORIX shares"]},
{"newsitem": ["\r\n\t\r\n\tSri Lanka’s civilian flights to the East coast opened with the Batticaloa airport being fully commissioned at the weekend however air services are restricted to only da..."], "date": [" March 26, 2018 07:08 pm"], "comments": ["Comments - 0 / views : 279 ", " "], "title": ["No flying by night to Batticaloa"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tIndia has introduced a Minimum Import Price (MIP) of Indian Rupees 500 per kg for pepper which works out to US$7,700 per mt effective from December 6, 2017, creat..."], "date": [" March 26, 2018 01:39 pm"], "comments": ["Comments - 0 / views : 121 ", " "], "title": ["SL pepper exports to India in jeopardy over new  barriers"]},
{"newsitem": ["\r\n\tProposals submitted by the Agricultural Ministry and the Plantations Industries Ministry for the re-introduction of glyphosate on the plantations will be taken up next week by t..."], "date": [" March 21, 2018 03:36 pm"], "comments": ["Comments - 0 / views : 203 ", " "], "title": ["Cabinet approval sought for glyphosate ban removal"]},
{"newsitem": ["\r\n\tSerendib Engineering Group PLC, which provides engineering solutions to major state infrastructure outfits, saw its controlling stake change on Wednesday morning at 10 am.&..."], "date": [" March 21, 2018 10:15 am"], "comments": ["Comments - 0 / views : 109 ", " "], "title": ["Serendib Engineering controlling stake changes hands"]},
{"newsitem": ["\r\n\t\r\n\tPrices of cigarettes in Sri Lanka are the highest in the Asia Pacific region and the second highest in the world with the island rapidly turning into a cigarette smugglers &l..."], "date": [" March 21, 2018 08:43 am"], "comments": ["Comments - 0 / views : 320 ", " "], "title": ["SL cigarette prices highest in Asia-report"]},
{"newsitem": ["\r\n\t\r\n\tThe demutualisation process that has been dawdling for a while owing to dissent between the Securities and Exchange Commission (SEC) and brokers over the percentage that the ..."], "date": [" March 20, 2018 12:30 pm"], "comments": ["Comments - 0 / views : 105 ", " "], "title": ["Backdoor tactics by some brokers on split of CSE demutualisation"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSri Lanka’s travel industry spearheaded by the Ministry of Tourism came together on Monday to assure international operators that normalcy has been restored..."], "date": [" March 19, 2018 07:10 pm"], "comments": ["Comments - 0 / views : 65 ", " "], "title": ["SL travel industry assures country back to normal"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tCeylon Association of Shipping Agents (CASA), the voice of the shipping industry, has welcomed an initiative by the Ministry of Ports and Shipping and the Sri Lan..."], "date": [" March 15, 2018 07:37 pm"], "comments": ["Comments - 0 / views : 175 ", " "], "title": ["Terminal Operators at Colombo Port agree to cooperate, work together"]},
{"newsitem": ["\r\n\tThe government will be closely examining the working hours of women in the workplace with prospects of reforms, State Minister for Finance Eran Wickramaratne said today.\r\n\r\n\r\n\r\n..."], "date": [" March 15, 2018 07:11 pm"], "comments": ["Comments - 1 / views : 774 ", " "], "title": ["Sri Lanka to decide on late working hours for women"]},
{"newsitem": ["\r\n\tThe government is preparing to impose a 100 metre ban on the sale of cigarettes from certain places and also ban the sale of individual cigarettes, the Tobacco Retailers Associa..."], "date": [" March 15, 2018 12:31 pm"], "comments": ["Comments - 1 / views : 224 ", " "], "title": ["Sri Lanka prepares to tighten cigarette sales"]},
{"newsitem": ["\r\n\tAt least 10 per cent of tourists scheduled to visit Kandy have made cancellations ahead of their travel plans in the wake of the tension experienced in the district during the p..."], "date": [" March 08, 2018 04:05 pm"], "comments": ["Comments - 0 / views : 432 ", " "], "title": ["UPDATE: Tourists cancel checking-in, advised to move out of Kandy"]},
{"newsitem": ["\r\n\t\r\n\tShares at the Colombo stock market on Thursday bounced back after falling the previous day, with analysts saying that trades on counters such as NTB, JKH and East West made i..."], "date": [" March 08, 2018 04:02 pm"], "comments": ["Comments - 0 / views : 151 ", " "], "title": ["STOCKS: Colombo shares rebound on NTB, JKH, East West trades "]},
{"newsitem": ["\r\n\tSri Lankan tourism authorities issuing a statement on the current situation in Kandy on Thursday afternoon said that tourists could now resume their travel plans to the hil..."], "date": [" March 08, 2018 02:14 pm"], "comments": ["Comments - 0 / views : 188 ", " "], "title": ["Tourists informed Kandy “fast returning to normalcy”"]},
{"newsitem": ["\r\n\tSeveral countries have updated their travel advisories indicating to their citizens about the current situation in Kandy. However, no travel advisories have increased their aler..."], "date": [" March 08, 2018 01:38 pm"], "comments": ["Comments - 0 / views : 125 ", " "], "title": ["Travel advisories on Sri Lanka remain neutral"]},
{"newsitem": ["\r\n\tSri Lanka’s Central Bank (CB) has vigorously denied reports that it was short of cash to pay for huge debts this year.\r\n\t“The CB has observed media reports erroneous..."], "date": [" April 25, 2018 01:59 pm"], "comments": ["Comments - 0 / views : 82 ", " "], "title": ["All debt payments in 2018 will be honoured: CB"]},
{"newsitem": ["\r\n\tThe Government will be strengthening the police force in tourist hotspots in a bid to contain incidents of violent attacks against travellers to these destinations in the wake o..."], "date": [" April 20, 2018 12:47 pm"], "comments": ["Comments - 0 / views : 271 ", " "], "title": ["Sri Lanka tightens security at tourist hotspots"]},
{"newsitem": ["\r\n\t\r\n\tSri Lankan trade unions are to ignore a Government decision to change May Day, saying they will go ahead with May 1 rallies and processions – bracing for a possible con..."], "date": [" April 19, 2018 07:32 pm"], "comments": ["Comments - 0 / views : 160 ", " "], "title": ["Unions go ahead with May 1 rallies, ignoring official May 7 change in date"]},
{"newsitem": ["\r\n\t\r\n\tSri Lanka’s Gem and Jewellery industry is falling apart, accusing the government of neglect, not properly fostering the sector and removing a key tax concession in rece..."], "date": [" April 19, 2018 06:57 am"], "comments": ["Comments - 4 / views : 1048 ", " "], "title": ["Tax exemption removal worries Lankan gem trade"]},
{"newsitem": ["\r\n\tSri Lanka's tourism authorities have ordered to close the establishment where the recent sexual and physical assault of tourists occurred on April 8 in Mirissa.\r\n\tThe Sri L..."], "date": [" April 17, 2018 06:35 pm"], "comments": ["Comments - 2 / views : 418 ", " "], "title": ["Govt. takes serious note, authorities close Mirissa hotel"]},
{"newsitem": ["\r\n\t\r\n\tSri Lanka’s Central Bank (CB) on Monday alerted the public to the dangers of dabbling in cryptocurrencies which it said “may pose significant risks in terms of fi..."], "date": [" April 16, 2018 06:39 pm"], "comments": ["Comments - 0 / views : 155 ", " "], "title": ["CB cautions against the use of virtual currencies in Sri Lanka"]},
{"newsitem": ["\r\n\tSri Lankan government believes there are “unseen hands” linked politically in carrying out orchestrated attacks on tourists like the recent physical and sexual attac..."], "date": [" April 16, 2018 04:39 pm"], "comments": ["Comments - 0 / views : 293 ", " "], "title": ["Govt. suspects organised attacks on tourists"]},
{"newsitem": ["\r\n\t \r\n\tSri Lanka is set to introduce a cost-reflective transparent fuel pricing, based on international market prices, next month. This new transparent mechanism will be submi..."], "date": [" April 16, 2018 02:26 pm"], "comments": ["Comments - 0 / views : 621 ", " "], "title": ["Sri Lanka’s fuel pricing formula comes into effect in May"]},
{"newsitem": ["\r\n\t\r\n\tThe number of travellers to the UK from Sri Lanka has grown during the past few years for business and for other purposes, the UK said, announcing a new online visa facility...."], "date": [" April 06, 2018 05:37 pm"], "comments": ["Comments - 2 / views : 759 ", " "], "title": ["Online visas to the UK from April 5"]},
{"newsitem": ["\r\n\tSri Lanka has made double digit growth in digital payments which is considered to be a substantial increase for credit card platforms like Visa which arrived in the country 30 y..."], "date": [" April 05, 2018 07:00 pm"], "comments": ["Comments - 0 / views : 233 ", " "], "title": ["SL makes double digit growth in digital payments"]},
{"newsitem": ["\r\n\t\r\n\tThe new board of directors at national carrier SriLankan Airlines has assured that plans are underway to turnaround the organization in three years.\r\n\tThe airline's new C..."], "date": [" April 05, 2018 02:04 pm"], "comments": ["Comments - 0 / views : 501 ", " "], "title": ["SriLankan Airlines turnaround in 3 years"]},
{"newsitem": ["\r\n\tFitch Ratings, a global rating agency, has increased its ownership of Fitch Ratings Lanka Ltd to approximately 89 per cent from 45 per cent through its acquisition of the equity..."], "date": [" April 05, 2018 09:37 am"], "comments": ["Comments - 0 / views : 136 ", " "], "title": ["Global Fitch Ratings raises stake in Sri Lanka unit"]},
{"newsitem": ["\r\n\t\r\n\tSeveral trade unions have opposed the state postponement, because it clashes with Wesak, of May Day rallies on May 1 saying they will go ahead with their rallies.\r\n\tOne such ..."], "date": [" April 04, 2018 11:22 pm"], "comments": ["Comments - 0 / views : 109 ", " "], "title": ["Some unions to go ahead with May 1 rallies"]},
{"newsitem": ["\r\n\t\r\n\t \r\n\tSri Lanka’s Central Bank (CB) is closely monitoring the deal between the EAP Group and a Singapore investment fund company to sell its subsidiaries of the grou..."], "date": [" April 04, 2018 07:23 pm"], "comments": ["Comments - 0 / views : 235 ", " "], "title": ["Central Bank closely monitors EAP Group deal    "]},
{"newsitem": ["\r\n\t \r\n\tSri Lanka’s need of the hour is to overcome the current political instability quickly as prolonged instability will bring disaster to the country’s economic..."], "date": [" April 04, 2018 07:16 pm"], "comments": ["Comments - 0 / views : 140 ", " "], "title": ["Sri Lanka desperately need political stability - CB governor "]},
{"newsitem": ["\r\n\tSri Lanka’s Central Bank on Wednesday announced a cut in interest rates aimed at stimulating growth in an economy that recorded its lowest growth in nearly a decade, ..."], "date": [" April 04, 2018 08:13 am"], "comments": ["Comments - 0 / views : 283 ", " "], "title": ["Sri Lanka’s Central Bank cuts interest rates***"]},
{"newsitem": ["\r\n\t\r\n\tA new Board of Directors under the Chairmanship of Mr. Ranjit Fernando took over at SriLankan Airlines on Tuesday in order to accelerate the restructuring process and create ..."], "date": [" April 03, 2018 06:37 pm"], "comments": ["Comments - 0 / views : 288 ", " "], "title": [" SriLankan Airlines restructuring continues, new directors to meet media on Thursday"]},
{"newsitem": ["\r\n\t\r\n\tThe new Board of Directors at cash-strapped Srilankan Airlines chaired by veteran banker and one-time public servant Ranjith Fernando will assume office tomorrow (Tuesday).\r\n..."], "date": [" April 02, 2018 08:46 pm"], "comments": ["Comments - 0 / views : 258 ", " "], "title": ["New SriLankan Airlines Board takes over tomorrow"]},
{"newsitem": ["\r\n\t\r\n\tRecognising New Zealand’s importance as a friendly nation that Sri Lanka supported at the Security Council, Tourism Minister John Amaratunga on Monday highlighted the n..."], "date": [" April 02, 2018 07:03 pm"], "comments": ["Comments - 0 / views : 156 ", " "], "title": ["Sri Lanka wants to bridge trade deficit with NZ"]},
{"newsitem": ["\r\n\t\r\n\tSri Lankans will witness an “exceptional country exhibition” when the Japan Sri Lanka Expo 2018 is held on April 21-23 at the BMICH, according to Ruwan Perera, Ch..."], "date": [" March 30, 2018 03:53 pm"], "comments": ["Comments - 0 / views : 516 ", " "], "title": ["Japan-Sri Lanka Expo 2018 on April 21-23 "]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSri Lanka’s main business chamber on Wednesday urged all Sri Lankans to act responsibly and help the authorities restore normalcy.\r\n\tResponding to the impos..."], "date": [" March 07, 2018 11:09 pm"], "comments": ["Comments - 0 / views : 115 ", " "], "title": ["Sri Lanka's main business chamber urges people to stay calm, calls for religious harmony"]},
{"newsitem": ["\r\n\tShares at the Colombo stock market on Wednesday edged lower on uncertainty and worries over the state of emergency imposed in Sri Lanka on Tuesday, analysts said.\r\n\r\n\r\n\r\n\tThe Al..."], "date": [" March 07, 2018 05:03 pm"], "comments": ["Comments - 0 / views : 215 ", " "], "title": ["Colombo shares down on Sri Lankan unrest "]},
{"newsitem": ["\r\n\tInsurance giant, Sri Lanka Insurance Corporation (SLIC) has laid claim as one of the strongest insurance companies in the Asian region.\r\n\tHemaka Amarasooriya, Chairman, SLI..."], "date": [" March 07, 2018 01:29 pm"], "comments": ["Comments - 0 / views : 74 ", " "], "title": ["Sri Lanka’s insurance giant SLC strongest in the region"]},
{"newsitem": ["\r\n\tLaugfs Gas PLC will be segregated with three out of its six subsidiaries to be individually listed on the Colombo Stock Exchange (CSE) from April 1 this year. Following the un-r..."], "date": [" March 07, 2018 09:44 am"], "comments": ["Comments - 0 / views : 126 ", " "], "title": ["Laugfs Gas PLC announces new re-structure aimed at profitability"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tThe promulgation of a state of emergency across Sri Lanka has been confirmed by a gazette notification issued tonight (Tuesday) by President Maithripala Sirisena...."], "date": [" March 06, 2018 11:17 pm"], "comments": ["Comments - 0 / views : 294 ", " "], "title": ["SL state of emergency gazette issued"]},
{"newsitem": ["\r\n\t\r\n\tThe US Embassy in Colombo on Tuesday urged the Government to “act quickly against perpetrators of sectarian violence, protect religious minorities and their places of w..."], "date": [" March 06, 2018 06:50 pm"], "comments": ["Comments - 0 / views : 102 ", " "], "title": ["US urges action against sectarian violence"]},
{"newsitem": ["\r\n\t\r\n\tThe Vehicle Importers Association of Lanka (VIAL), the main automobile importers association in Sri Lanka, has embarked on a new strategy to protect customers been swindled a..."], "date": [" March 06, 2018 03:13 pm"], "comments": ["Comments - 0 / views : 97 ", " "], "title": ["VIAL to protect Lankan customers from vehicle fraud"]},
{"newsitem": ["\r\n\tTourist arrivals to Sri Lanka are unlikely to feel the impact of the 10-day state of emergency which was declared today but the industry remained concerned that it was “no..."], "date": [" March 06, 2018 02:50 pm"], "comments": ["Comments - 1 / views : 668 ", " "], "title": ["Tourist arrivals unlikely to be impacted by SL state of emergency"]},
{"newsitem": ["\r\n\t\r\n\tThe Central Bank (CB) on Monday at around 12 noon sealed the premises of the Central Investment and Finance Ltd (CIFL) in Colombo following a decision to cancel the licence o..."], "date": [" March 05, 2018 10:21 pm"], "comments": ["Comments - 0 / views : 250 ", " "], "title": ["Central Bank seals CIFL premises in Colombo"]},
{"newsitem": ["\r\n\t\r\n\tThe Anantara Peace Haven Tangalle Resort on Monday celebrated the harvest of its first rice crops from its own organic paddy fields, located within the premises of the resort..."], "date": [" March 05, 2018 09:22 pm"], "comments": ["Comments - 0 / views : 114 ", " "], "title": ["Anantara Peace Haven Tangalle celebrates its first rice harvest "]},
{"newsitem": ["\r\n\tThe Vatican's top abuse investigator arrived in Chile on Tuesday, a day after Pope Francis accepted the resignation of three bishops from the scandal-wracked Chilean Church...."], "date": [" June 13, 2018 01:12 pm"], "comments": ["Comments - 0 / views : 30 ", " "], "title": ["Pope's envoys in Chile to 'ask forgiveness' over sex abuse"]},
{"newsitem": ["\r\n\tADEN (Reuters) - A Saudi-led coalition launched an assault on Yemen’s main port city of Hodeidah on Wednesday in the biggest battle of a three-year war between an alliance..."], "date": [" June 13, 2018 12:47 pm"], "comments": ["Comments - 0 / views : 20 ", " "], "title": ["Saudi-led coalition attacks Yemen's key port of Hodeidah"]},
{"newsitem": ["\r\n\tWASHINGTON (Reuters) - The top U.S. counterintelligence official is advising Americans traveling to Russia for football’s World Cup beginning this week that they should no..."], "date": [" June 13, 2018 12:14 pm"], "comments": ["Comments - 0 / views : 20 ", " "], "title": ["Exclusive: U.S. counterspy warns World Cup travelers' devices could be hacked"]},
{"newsitem": ["\r\n\tSINGAPORE (Reuters) - U.S. President Donald Trump made a stunning concession to North Korean leader Kim Jong Un on Tuesday about halting military exercises, pulling a surprise a..."], "date": [" June 13, 2018 12:03 pm"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["Trump in surprise summit move says he will halt Korea war games"]},
{"newsitem": ["\r\n\tROME (Reuters) - Italy plans to transfer migrants crammed aboard a charity boat onto other vessels on Tuesday and then sail them all to Spain, despite appeals from humanitarian ..."], "date": [" June 12, 2018 04:47 pm"], "comments": ["Comments - 0 / views : 25 ", " "], "title": ["Activists protest as Italy prepares to ship migrants to Spain"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tThe operating licence of troubled finance company Central Investments and Finance PLC (CIFL) has been cancelled with effect from Monday (March 3), the Central Ban..."], "date": [" March 05, 2018 05:22 pm"], "comments": ["Comments - 0 / views : 206 ", " "], "title": ["CILF finance company cancelled with immediate effect-Central Bank"]},
{"newsitem": ["\r\n\tColombo Port workers engaged in the clearance of containers and cleaners have resorted to trade union action on Monday following repeated requests to allow inspections and ..."], "date": [" March 05, 2018 03:58 pm"], "comments": ["Comments - 1 / views : 916 ", " "], "title": ["Colombo Port workers on strike"]},
{"newsitem": ["\r\n\t\r\n\tAirAsia and AirAsia X are offering five million promotional seats in its first major campaign of the year. Book from March 5 (0001h GMT +8) to March 11, 2018 (2359 GMT +..."], "date": [" March 05, 2018 02:30 pm"], "comments": ["Comments - 0 / views : 82 ", " "], "title": ["AirAsia’s new 5 mln seats promotion"]},
{"newsitem": ["\r\n\t\r\n\t \r\n\tThe Sri Lanka Consumer Affairs Authority (CAA) today (Monday) permitted two local companies Holcim Lanka, now rebranded as INSEE Cement and Tokyo Cement to increase ..."], "date": [" March 05, 2018 01:19 pm"], "comments": ["Comments - 0 / views : 259 ", " "], "title": ["Two cement companies permitted to increase prices"]},
{"newsitem": ["\r\n\t\r\n\tThe end of the war and peace in Sri Lanka has created confidence I the country and the international trading community with export earning reaching US$ 5.4 billion from $4 bi..."], "date": [" February 28, 2018 10:06 pm"], "comments": ["Comments - 0 / views : 263 ", " "], "title": ["E-bikes to be showcased at Colombo's “The Bike show” in August"]},
{"newsitem": ["\r\n\tSome 15,000 non-academic staff members of 15 state universities in Sri Lanka launched an indefinite strike on Tuesday demanding the government to implement conditions reached in..."], "date": [" February 27, 2018 11:40 am"], "comments": ["Comments - 0 / views : 3853 ", " "], "title": ["University non-academic staff launch strike to win anomalies"]},
{"newsitem": ["\r\n\t\r\n\tSriLankan Airlines, in an announcement on Monday, said there were “continuing” delays and congestion at Colombo Airport and regretted the inconvenience. \r\n\r\n..."], "date": [" February 26, 2018 04:06 pm"], "comments": ["Comments - 0 / views : 538 ", " "], "title": ["Delays on SriLankan Airlines flights"]},
{"newsitem": ["\r\n\tSINGAPORE (Reuters) - U.S. President Donald Trump and North Korean leader Kim Jong Un pledged on Tuesday to work toward complete denuclearization of the Korean peninsula while W..."], "date": [" June 12, 2018 04:10 pm"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["Trump, Kim agree on denuclearization, but deal seen symbolic"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSINGAPORE (Reuters) - U.S. President Donald Trump and North Korean leader Kim Jong Un shook hands and smiled as they started a historic summit on Tuesday, just mo..."], "date": [" June 12, 2018 09:24 am"], "comments": ["Comments - 0 / views : 36 ", " "], "title": ["Trump, Kim launch historic Singapore summit with a handshake"]},
{"newsitem": ["\r\n\tBENGALURU/NEW DELHI (Reuters) - The slow pace of fitting out regional airports risks delaying Indian Prime Minister Narendra Modi’s ambitious plan to launch more flights c..."], "date": [" June 11, 2018 12:35 pm"], "comments": ["Comments - 0 / views : 89 ", " "], "title": ["Modi's plan to get millions more Indians flying faces turbulence"]},
{"newsitem": ["\r\n\tSINGAPORE (Reuters) - U.S. President Donald Trump fired off a volley of tweets on Monday venting anger on NATO allies, the European Union and Canadian Prime Minister Justin Trud..."], "date": [" June 11, 2018 12:31 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["'Fair trade, fool trade', Trump vents anger on NATO allies, EU, Trudeau post-G7"]},
{"newsitem": ["\r\n\tHobbled by blisters and stalked by hunger, dozens of Afghan protesters are marching hundreds of kilometres across the war-torn country demanding an end to the nearly 17-year con..."], "date": [" June 11, 2018 12:26 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["Blistered and hungry: Afghans walk hundreds of kilometres for peace"]},
{"newsitem": ["\r\n\tSEOUL/WASHINGTON (Reuters) - North Korea’s top three military officials have been removed from their posts, a senior U.S. official said, a move analysts said on Monday cou..."], "date": [" June 04, 2018 02:04 pm"], "comments": ["Comments - 0 / views : 38 ", " "], "title": ["North Korea shakes up top military brass ahead of Trump summit - U.S. official"]},
{"newsitem": ["\r\n\tJapan killed 122 pregnant minke whales during a highly controversial annual whaling expedition that Tokyo defends as scientific research but conservationists call \"gruesome..."], "date": [" May 31, 2018 01:10 pm"], "comments": ["Comments - 0 / views : 153 ", " "], "title": ["Japan whale hunt killed 122 pregnant minkes"]},
{"newsitem": ["\r\n\tYANGON (Reuters) - Evidence Myanmar police say they obtained from the mobile phones of two Reuters reporters accused of possessing secret documents might be “tainted&rdquo..."], "date": [" May 31, 2018 12:57 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["Myanmar lawyer says evidence from Reuters reporters' phones may be 'tainted'"]},
{"newsitem": ["\r\n\tPEARL HARBOR, Hawaii (Reuters) - The U.S. military on Wednesday renamed its Pacific Command the U.S. Indo-Pacific Command, in a largely symbolic move underscoring the growing im..."], "date": [" May 31, 2018 12:56 pm"], "comments": ["Comments - 0 / views : 49 ", " "], "title": ["In symbolic nod to India, U.S. Pacific Command changes name"]},
{"newsitem": ["\r\n\tNEW YORK (Reuters) - U.S. Secretary of State Mike Pompeo and high-ranking North Korean official Kim Yong Chol enter a second day of meetings in New York on Thursday as they try ..."], "date": [" May 31, 2018 12:52 pm"], "comments": ["Comments - 0 / views : 25 ", " "], "title": ["U.S., North Korea enter second day of nuclear talks"]},
{"newsitem": ["\r\n\tWASHINGTON (Reuters) - U.S. President Donald Trump said on Tuesday meetings were being held to set up a summit with North Korea and confirmed that a top North Korean official wa..."], "date": [" May 29, 2018 04:23 pm"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["Trump says meetings taking place on U.S.-North Korea summit"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\t \r\n\r\n\r\n\r\n\t• New Zealand tops the list as the least corrupt country\r\n\r\n\r\n\r\n\t• Bhutan, placed 26, heads the South Asia region in terms of least corru..."], "date": [" February 22, 2018 09:06 am"], "comments": ["Comments - 0 / views : 203 ", " "], "title": ["Transparency International's Corruption Index shows slow, imperfect progress across Asia"]},
{"newsitem": ["\r\n\t\r\n\tWhile there has been demand for US dollars in recent days as foreigners sold stocks in the Colombo bourse and bonds, the dollar appears to be stabilizing in the money markets..."], "date": [" February 21, 2018 03:42 pm"], "comments": ["Comments - 0 / views : 225 ", " "], "title": ["US dollar seen stabilizing in Colombo's money markets"]},
{"newsitem": ["\r\n\t\r\n\tChinese workers have come in; Indian workers are competing and over-running the Sri Lankan labour force. Now Nepalese and Myanmar workers are coming as the government ha..."], "date": [" February 20, 2018 12:45 pm"], "comments": ["Comments - 0 / views : 395 ", " "], "title": ["Foreign construction workers outshine local counterparts"]},
{"newsitem": ["\r\n\tThe family of the young boy saved by \"Spiderman\" Mamoudou Gassama in a daring rescue that won him global acclaim and a promise of French citizenship has thanked the Ma..."], "date": [" May 29, 2018 04:20 pm"], "comments": ["Comments - 0 / views : 53 ", " "], "title": ["French family of rescued boy thanks hero Malian 'Spiderman'"]},
{"newsitem": ["\r\n\tA top North Korean general is headed for the United States in what would be the highest-profile visit in years, reports said Tuesday as the two countries prepare for a momentous..."], "date": [" May 29, 2018 04:13 pm"], "comments": ["Comments - 0 / views : 21 ", " "], "title": ["Top North Korean general on way to US ahead of summit: report"]},
{"newsitem": ["\r\n\tBEIJING (Reuters) - China will host Iranian President Hassan Rouhani next month at a regional summit aimed at avoiding disruption of joint projects, its foreign ministry said on..."], "date": [" May 28, 2018 06:33 pm"], "comments": ["Comments - 0 / views : 42 ", " "], "title": ["China to host Iran to avoid project disruption amid nuclear deal doubt"]},
{"newsitem": ["\r\n\tRIYADH (Reuters) - Bahrain sees no resolution in sight to a diplomatic row between Qatar and its neighbors, which cut diplomatic and trade ties with the tiny Gulf Arab state nea..."], "date": [" May 28, 2018 06:30 pm"], "comments": ["Comments - 0 / views : 37 ", " "], "title": ["Bahrain sees 'no glimmer of hope' for ending Qatar crisis soon"]},
{"newsitem": ["\r\n\tDonald Trump and Kim Jong Un were making last-minute preparations Monday on the eve of their historic summit, as officials scrambled to narrow yawning differences over Pyongyang..."], "date": [" June 11, 2018 12:23 pm"], "comments": ["Comments - 0 / views : 23 ", " "], "title": ["Kim, Trump in countdown to historic summit"]},
{"newsitem": ["\r\n\tSINGAPORE (Reuters) - U.S. and North Korean officials were in talks in Singapore on Monday in a late bid to narrow differences before their leaders hold an historic summit aimed..."], "date": [" June 11, 2018 12:13 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["North Korean, U.S. officials try narrowing differences on eve of Trump-Kim summit"]},
{"newsitem": ["\r\n\tAward-winning chef, writer and television personality Anthony Bourdain has died in an apparent suicide, according to CNN. He was 61.\r\n\r\n\r\n\r\n\tCNN confirmed his death in a stateme..."], "date": [" June 08, 2018 06:36 pm"], "comments": ["Comments - 0 / views : 207 ", " "], "title": ["Anthony Bourdain dies at 61 in apparent suicide, CNN says"]},
{"newsitem": ["\r\n\tDesigner Kate Spade, one of the biggest names in American fashion known especially for her sleek handbags, was found dead Tuesday in her New York apartment. She was 55.\r\n\r\n\r\n\r\n\t..."], "date": [" June 06, 2018 03:04 pm"], "comments": ["Comments - 0 / views : 57 ", " "], "title": ["US designer Kate Spade found dead at 55"]},
{"newsitem": ["\r\n\tGUATEMALA CITY (Reuters) - Guatemalan authorities warned that the Fuego volcano was showing signs of greater activity on Tuesday night as the death toll from a devastating erupt..."], "date": [" June 06, 2018 02:58 pm"], "comments": ["Comments - 0 / views : 21 ", " "], "title": ["Guatemala warns of greater activity after volcano explodes again"]},
{"newsitem": ["\r\n\tSINGAPORE (Reuters) - Singapore airspace will be restricted during the planned U.S.-N.Korea summit next week, according to a notice to airmen posted by aviation authorities on W..."], "date": [" June 06, 2018 02:32 pm"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Singapore to restrict airspace during U.S.-North Korea summit"]},
{"newsitem": ["\r\n\tHONG KONG (Reuters) - A Hong Kong court on Monday sentenced two former lawmakers to four weeks in jail for unlawful assembly inside the legislature while they were still lawmake..."], "date": [" June 04, 2018 02:58 pm"], "comments": ["Comments - 0 / views : 36 ", " "], "title": ["Former Hong Kong lawmakers sentenced to month in jail"]},
{"newsitem": ["\r\n\tLONDON (Reuters) - The world should stand up to Washington’s bullying behavior, Iran’s foreign minister was quoted as saying on Sunday by state media in a letter to ..."], "date": [" June 04, 2018 02:19 pm"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["Iran calls on world to stand up to Trump, save nuclear deal"]},
{"newsitem": ["\r\n\tBEIJING (Reuters) - The United States urges China to make a full public account of those killed, detained or who went missing during a crackdown on student-led pro-democracy pro..."], "date": [" June 04, 2018 02:15 pm"], "comments": ["Comments - 0 / views : 30 ", " "], "title": ["U.S. calls for China to account for the 'ghosts' of Tiananmen"]},
{"newsitem": ["\r\n\tGUATEMALA CITY (Reuters) - An estimated 25 people, including at least three children, were killed and nearly 300 injured on Sunday in the most violent eruption of Guatemala&rsqu..."], "date": [" June 04, 2018 02:10 pm"], "comments": ["Comments - 0 / views : 24 ", " "], "title": ["Guatemala's Fuego volcano eruption kills 25, injures hundreds"]},
{"newsitem": ["\r\n\tROME (Reuters) - Italy’s president is expected to ask a former International Monetary Fund official on Monday to head a stopgap government amidst political and constitutio..."], "date": [" May 28, 2018 03:10 pm"], "comments": ["Comments - 0 / views : 20 ", " "], "title": ["Italy's president calls in former IMF official amid political turmoil"]},
{"newsitem": ["\r\n\tIrish voters headed to the polls on Friday to vote in a landmark referendum on whether the traditionally Catholic country should liberalise some of the strictest abortion laws i..."], "date": [" May 25, 2018 05:11 pm"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Ireland votes in historic abortion referendum"]},
{"newsitem": ["\r\n\tThe Netherlands and Australia Friday accused Moscow of being behind the 2014 shooting down of flight MH17 over war-torn eastern Ukraine with the loss of 298 lives, in a move whi..."], "date": [" May 25, 2018 04:50 pm"], "comments": ["Comments - 0 / views : 36 ", " "], "title": ["Dutch, Australia say Russia responsible for downing MH17"]},
{"newsitem": ["\r\n\tBEIJING (Reuters) - U.S. President Donald Trump’s cancellation of a summit with North Korean leader Kim Jong Un threatens further strain on U.S.-China ties amid a trade di..."], "date": [" May 25, 2018 03:43 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["Collapse of Trump-Kim summit threatens to deepen U.S.-China rift"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tTORONTO (Reuters) - Two unidentified men walked into a restaurant on Thursday in the Canadian city of Mississauga and set off a bomb, wounding more than a dozen p..."], "date": [" May 25, 2018 03:42 pm"], "comments": ["Comments - 0 / views : 34 ", " "], "title": ["Two men set off bomb in restaurant in Canada; 15 wounded"]},
{"newsitem": ["\r\n\tSEOUL (Reuters) - North Korea said on Friday it was still open to talks with the United States after President Donald Trump called off a summit with leader Kim Jong Un, saying i..."], "date": [" May 25, 2018 03:38 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["North Korea says it's still open to talks after Trump cancels summit"]},
{"newsitem": ["\r\n\tBEIJING (Reuters) - China has found no clues to explain what happened to an American citizen working at a U.S. consulate who reported suffering from “abnormal” sound..."], "date": [" May 24, 2018 04:16 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["China says finds no clues to explain U.S. sonic incident"]},
{"newsitem": ["\r\n\tBAGHDAD (Reuters) - At least four people were killed and 15 wounded in a suicide attack in Iraq’s capital Baghdad on Thursday, a military spokesman told Reuters.\r\n\r\n\r\n\r\n\tT..."], "date": [" May 24, 2018 04:12 pm"], "comments": ["Comments - 0 / views : 23 ", " "], "title": ["At least four killed, 15 wounded in Baghdad bomb blast"]},
{"newsitem": ["\r\n\tBEIRUT (Reuters) - Lebanon’s Saad al-Hariri is on track to become prime minister for a third time after winning the backing of a majority of MPs in official consultations ..."], "date": [" May 24, 2018 04:10 pm"], "comments": ["Comments - 0 / views : 21 ", " "], "title": ["Lebanon's Hariri PM on track to become PM for third time"]},
{"newsitem": ["\r\n\tBUNNIK, NETHERLANDS (Reuters) - Prosecutors investigating the downing of flight MH17 over eastern Ukraine in 2014 said on Thursday they had identified the missile used to shoot ..."], "date": [" May 24, 2018 03:50 pm"], "comments": ["Comments - 0 / views : 29 ", " "], "title": ["Investigators say identify Russian military unit in MH17 downing"]},
{"newsitem": ["\r\n\tJAKARTA (Reuters) - Indonesia’s most active volcano, Mount Merapi on densely populated Java island, has shown danger signs with a series of small eruptions, and authoritie..."], "date": [" May 22, 2018 12:41 pm"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["Indonesia's most active volcano rumbles, public ordered to stay away"]},
{"newsitem": ["\r\n\tAuthorities in Hawaii have warned of dangerous \"laze\" fumes as molten lava from the erupting Kilauea volcano reached the Pacific Ocean.\r\n\r\n\r\n\r\n\tTwo lava flows \"re..."], "date": [" May 21, 2018 03:25 pm"], "comments": ["Comments - 0 / views : 35 ", " "], "title": ["Dangerous 'laze' forms as Hawaii volcano lava reaches ocean"]},
{"newsitem": ["\r\n\tBUENOS AIRES (Reuters) - The United States will not recognize the result of Venezuela’s presidential election on Sunday, U.S. Deputy Secretary of State John Sullivan told ..."], "date": [" May 21, 2018 02:58 pm"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["U.S. will not recognize Venezuela election result: State Department"]},
{"newsitem": ["\r\n\tHAVANA (Reuters) - Cubans in eastern Holguin province held a funeral on Sunday for an art instructor and her small child, the first of 67 Holguin residents to be brought home fo..."], "date": [" May 21, 2018 02:07 pm"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["Cuba begins to bury its dead from airline disaster"]},
{"newsitem": ["\r\n\tCARACAS, Venezuela (Reuters) - Venezuela’s leftist leader Nicolas Maduro won a new six-year term on Sunday, but his main rivals disavowed the election alleging massive irr..."], "date": [" May 21, 2018 12:56 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["Venezuela's Maduro re-elected amid outcry over vote"]},
{"newsitem": ["\r\n\tKUALA LUMPUR (Reuters) - Malaysian police seized 284 boxes of designer handbags and dozens of bags filled with cash and jewelry on Friday from a luxury condominium in the center..."], "date": [" May 18, 2018 03:47 pm"], "comments": ["Comments - 0 / views : 59 ", " "], "title": ["Hundreds of designer bags, jewellery, cash seized in Malaysia from ex-PM"]},
{"newsitem": ["\r\n\tBEIJING (Reuters) - China said on Friday that it stands for stability and peace on the Korean peninsula and for settlement of the issue through talks, after U.S. President Donal..."], "date": [" May 18, 2018 03:08 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["China says it stands for stability, peace on Korean peninsula"]},
{"newsitem": ["\r\n\tKUALA LUMPUR (Reuters) - Malaysian police conducted searches through the night and into the Thursday morning at five places linked to ousted Prime Minister Najib Razak, includin..."], "date": [" May 17, 2018 03:10 pm"], "comments": ["Comments - 0 / views : 47 ", " "], "title": ["Malaysian police search five places linked to ousted PM Najib"]},
{"newsitem": ["\r\n\tGAZA/JERUSALEM (Reuters) - Palestinian protests on the Gaza-Israel border have dropped off over the past two days, amid reports that Egyptian officials intervened to restore cal..."], "date": [" May 17, 2018 12:36 pm"], "comments": ["Comments - 0 / views : 46 ", " "], "title": ["Israel says Hamas curbed Gaza protests after Egyptian warning"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tGAZA (Reuters) - The Palestinian death toll from Israeli live fire in protests along the Gaza-Israel border on Monday rose to 52, a Palestinian health ministry of..."], "date": [" May 15, 2018 03:28 pm"], "comments": ["Comments - 0 / views : 49 ", " "], "title": ["Death toll in Gaza protests up to 52: Palestinian health ministry"]},
{"newsitem": ["\r\n\tA female mayor at the centre of a fierce debate over allowing women into the sumo ring vowed Thursday never to back down as she prepared to lodge a formal protest.\r\n\r\n\r\n\r\n\t&quot..."], "date": [" April 19, 2018 03:17 pm"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["Japan female mayor battles men-only sumo rule"]},
{"newsitem": ["\r\n\tStripy and Jake are bear cubs fed by bottle, who frisk around happily. Other bear orphans perch in the trees when Ben Kilham ventures into their enclosure.\r\n\r\n\r\n\r\n\tMeet the Amer..."], "date": [" April 19, 2018 03:12 pm"], "comments": ["Comments - 0 / views : 21 ", " "], "title": ["Ben Kilham, the American bear whisperer"]},
{"newsitem": ["\r\n\tA peace treaty to formally end the Korean War \"must be pursued\", South Korean President Moon Jae-in said Thursday, ahead of a summit next week with Kim Jong Un, leader..."], "date": [" April 19, 2018 02:54 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["S. Korea's Moon: a peace treaty 'must be pursued'"]},
{"newsitem": ["\r\n\tLONDON (Reuters) - Hundreds of noisy protesters greeted Indian Prime Minister Narendra Modi when he arrived in London on Wednesday, demonstrating over a rising tide of sexual vi..."], "date": [" April 19, 2018 02:00 pm"], "comments": ["Comments - 0 / views : 36 ", " "], "title": ["Indian Prime Minister Modi confronted by angry protests in London"]},
{"newsitem": ["\r\n\tHOUSTON (Reuters) - A private funeral for former U.S. first lady Barbara Bush, the only American woman to see her husband and son both sworn in as president, will be held on Sat..."], "date": [" April 19, 2018 01:41 pm"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Barbara Bush funeral planned for Saturday at Houston church"]},
{"newsitem": ["\r\n\tAMMAN (Reuters) - Syrian anti-aircraft defenses shot down missiles fired at the Syrian air base of Shayrat in Homs province late on Monday and another base northeast of the..."], "date": [" April 17, 2018 03:10 pm"], "comments": ["Comments - 0 / views : 52 ", " "], "title": ["Syrian air defenses shoot down missiles over two air bases: state TV, Hezbollah"]},
{"newsitem": ["\r\n\tTOKYO (Reuters) - Foreigners held in a Japanese immigration detention center have launched a hunger strike over the death of a detainee, drawing fresh attention to conditions un..."], "date": [" April 17, 2018 03:04 pm"], "comments": ["Comments - 0 / views : 34 ", " "], "title": ["Japanese immigration detainees launch hunger strike over death"]},
{"newsitem": ["\r\n\tKATHMANDU (Reuters) - A crude bomb went off outside an Indian government relief office in Nepal causing minor damage but no injuries, officials said on Tuesday, in what appeared..."], "date": [" April 17, 2018 01:45 pm"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["Crude bomb blast at Indian government relief office in Nepal, no injuries"]},
{"newsitem": ["\r\n\tWASHINGTON (Reuters) - Barbara Bush, the wife of former U.S. President George H.W. Bush, is in “failing health” and has decided to no longer seek medical treatment, ..."], "date": [" April 16, 2018 12:16 pm"], "comments": ["Comments - 0 / views : 62 ", " "], "title": ["Barbara Bush, wife of ex-President George H.W. Bush, in 'failing health'"]},
{"newsitem": ["\r\n\tFired former FBI chief James Comey lashed out at Donald Trump in an interview with ABC broadcast Sunday, calling him \"morally unfit\" to be president and describing him..."], "date": [" April 16, 2018 12:01 pm"], "comments": ["Comments - 0 / views : 26 ", " "], "title": ["Trump 'morally unfit' for office, fired FBI chief Comey says"]},
{"newsitem": ["\r\n\tKUALA LUMPUR (Reuters) - Malaysian Prime Minister Mahathir Mohamad and jailed politician Anwar Ibrahim tried to ease a rift within the ruling alliance on Sunday after difference..."], "date": [" May 13, 2018 07:58 pm"], "comments": ["Comments - 0 / views : 121 ", " "], "title": ["Mahathir, Anwar step in as tensions flare within Malaysia's ruling alliance"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tKUALA LUMPUR (Reuters) - Malaysia’s newly-elected Prime Minister Mahathir Mohamad said on Friday that the country’s monarch has indicated he was willi..."], "date": [" May 11, 2018 12:03 pm"], "comments": ["Comments - 0 / views : 117 ", " "], "title": ["Malaysia's Mahathir says king willing to grant full pardon for Anwar"]},
{"newsitem": ["\r\n\tThe Mount Merapi volcano on densely populated Java island is one of the most active in Indonesia and a series of eruptions in 2010 killed more than 350 people.\r\n\r\n\r\n\r\n\tA disaste..."], "date": [" May 11, 2018 11:53 am"], "comments": ["Comments - 0 / views : 64 ", " "], "title": ["Indonesia evacuates residents, shuts airport after Java volcano erupts"]},
{"newsitem": ["\r\n\tBASEL (Reuters) - A 104-year-old Australian scientist killed himself in Switzerland on Thursday by lethal injection in an assisted suicide he hoped would trigger more lenient eu..."], "date": [" May 11, 2018 11:50 am"], "comments": ["Comments - 0 / views : 89 ", " "], "title": ["'This is taking an awfully long time!', says scientist before assisted suicide"]},
{"newsitem": ["\r\n\tJERUSALEM/BEIRUT (Reuters) - Israel said it attacked nearly all of Iran’s military infrastructure in Syria on Thursday after Iranian forces fired rockets at Israeli-held t..."], "date": [" May 11, 2018 11:30 am"], "comments": ["Comments - 0 / views : 40 ", " "], "title": ["Israel strikes Iranian targets in Syria after rocket fire"]},
{"newsitem": ["\r\n\tKUALA LUMPUR (Reuters) - Mahathir Mohamad was sworn in as Malaysia’s seventh prime minister on Thursday after a stunning election comeback, defeating the coalition that ha..."], "date": [" May 11, 2018 10:53 am"], "comments": ["Comments - 0 / views : 40 ", " "], "title": ["Mahathir, 92, sworn in as Malaysia's seventh prime minister"]},
{"newsitem": ["\r\n\tKUALA LUMPUR (Reuters) - Malaysia’s Najib Razak appeared to raise doubt on Thursday that his mentor-turned-foe Mahathir Mohamad would succeed him as prime minister followi..."], "date": [" May 10, 2018 10:33 am"], "comments": ["Comments - 0 / views : 53 ", " "], "title": ["Malaysia's Najib raises doubt that Mahathir will succeed him"]},
{"newsitem": ["\r\n\tKUALA LUMPUR (Reuters) - Malaysia’s Mahathir Mohamad has never lost an election campaign. He maintained that record and created another one on Thursday when, at 92, he was..."], "date": [" May 10, 2018 10:16 am"], "comments": ["Comments - 0 / views : 44 ", " "], "title": ["At 92, former strongman Mahathir is Malaysia's comeback kid"]},
{"newsitem": ["\r\n\tBEIJING/SEOUL (Reuters) - North Korean leader Kim Jong Un visited China and met President Xi Jinping, state media of both countries said on Tuesday, their second encounter in tw..."], "date": [" May 09, 2018 10:47 am"], "comments": ["Comments - 0 / views : 29 ", " "], "title": ["North Korean leader Kim visits China, meets President Xi"]},
{"newsitem": ["\r\n\tTOKYO (Reuters) - Japan has demanded that South Korea rethink a mango mousse dessert it plans to serve at a North-South summit dinner on Friday which features a map of the Korea..."], "date": [" April 25, 2018 12:04 pm"], "comments": ["Comments - 0 / views : 52 ", " "], "title": ["Unjust dessert? Japan demands Koreans wipe map off summit dinner mousse"]},
{"newsitem": ["\r\n\tBRUSSELS (Reuters) - A Belgian judge on Monday sentenced Salah Abdeslam, the prime surviving suspect in the 2015 Islamic State attacks on Paris, to 20 years in prison over a sho..."], "date": [" April 23, 2018 03:29 pm"], "comments": ["Comments - 0 / views : 43 ", " "], "title": ["Paris attacks suspect gets 20-year sentence in Brussels trial"]},
{"newsitem": ["\r\n\tSEOUL (Reuters) - South Korea halted the propaganda broadcasts it blares across the border at North Korea on Monday ahead of their first summit in a decade, as U.S. President Do..."], "date": [" April 23, 2018 03:19 pm"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["South Korea switches off propaganda broadcasts, Moon upbeat on North Korea nuclear halt"]},
{"newsitem": ["\r\n\tLONDON (Reuters) - Kate, the wife of Prince William, was admitted to hospital on Monday to give birth to the couple’s third child and the latest member of Britain’s ..."], "date": [" April 23, 2018 02:05 pm"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["Kate, wife of UK's Prince William, taken to hospital to give birth to third child"]},
{"newsitem": ["\r\n\tGAZA (Reuters) - Israel dropped leaflets in the Gaza Strip on Friday warning Palestinians not to approach its border fence as the military braced for fresh clashes along the fro..."], "date": [" April 20, 2018 01:27 pm"], "comments": ["Comments - 0 / views : 32 ", " "], "title": ["Israel drops leaflets warning Gazans not to approach border"]},
{"newsitem": ["\r\n\tKUALA LUMPUR (Reuters) - Malaysians voted on Wednesday in a cliffhanger general election.\r\n\r\n\r\n\r\n\tin which Prime Minister Najib Razak’s coalition is fending off a resurgen..."], "date": [" May 09, 2018 10:11 am"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Malaysians vote in cliffhanger election as politicians say phones jammed"]},
{"newsitem": ["\r\n\tMOSCOW (Reuters) - Russian will not offer to host a meeting between U.S. President Donald Trump and North Korean leader Kim Jong Un, Foreign Minister Sergei Lavrov said on Frida..."], "date": [" April 20, 2018 01:16 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["Russia says will not offer to host Trump meeting with North Korea's Kim: RIA"]},
{"newsitem": ["\r\n\tUS President Donald Trump repeatedly complained to FBI director James Comey in early 2017 that the Russia meddling investigation was a cloud over his young administration, weeks..."], "date": [" April 20, 2018 01:14 pm"], "comments": ["Comments - 0 / views : 22 ", " "], "title": ["Comey memos show Trump obsessed with Russia probe"]},
{"newsitem": ["\r\n\tVisitors to a zoo in southeastern China killed one kangaroo and injured another by throwing bricks at them in an attempt to get a reaction from the big marsupials, state media r..."], "date": [" April 20, 2018 12:48 pm"], "comments": ["Comments - 0 / views : 34 ", " "], "title": ["Brick-throwing China zoo-goers kill kangaroo, injure another"]},
{"newsitem": ["\r\n\tANKARA (Reuters) - A magnitude 5.9 earthquake on Thursday struck Iran’s southern province of Bushehr, which is home to a nuclear power plant, state television reported, bu..."], "date": [" April 19, 2018 04:00 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["Magnitude 5.9 quake strikes southern Iran, no casualties reported: TV"]},
{"newsitem": ["\r\n\tOutfits and instruments by late pop icon Prince, who was known for his distinct and unique style, will go under the hammer in New York next month.\r\n\r\n\r\n\r\n\tJulien's Auctions ..."], "date": [" April 19, 2018 03:23 pm"], "comments": ["Comments - 0 / views : 40 ", " "], "title": ["Singer Prince's glittering outfits, guitars go on sale"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tIsraeli Prime Minister Benjamin Netanyahu said he had new \"proof\" of an Iranian nuclear weapons plan that could be activated at any time, as the US cons..."], "date": [" May 01, 2018 02:20 pm"], "comments": ["Comments - 0 / views : 72 ", " "], "title": ["Netanyahu unveils Iran 'secret nuclear files' as US approaches"]},
{"newsitem": ["\r\n\tSEOUL (Reuters) - North and South Korea began dismantling loudspeakers that blared propaganda across their heavily fortified border on Tuesday, South Korea’s defense minis..."], "date": [" May 01, 2018 02:12 pm"], "comments": ["Comments - 0 / views : 48 ", " "], "title": ["North and South Korea start to dismantle border speakers, fulfilling summit pledge"]},
{"newsitem": ["\r\n\tLONDON (Reuters) - Britain’s trade minister said on Tuesday that unelected lawmakers in parliament’s upper House of Lords were trying to block the will of the people..."], "date": [" May 01, 2018 02:09 pm"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["Liam Fox says unelected peers trying to block the people's will over Brexit"]},
{"newsitem": ["\r\n\tMELBOURNE (Reuters) - Vatican Treasurer George Pell must face trial on charges of historical sexual offences, an Australian court ruled on Tuesday, making him the most senior Ca..."], "date": [" May 01, 2018 02:07 pm"], "comments": ["Comments - 0 / views : 40 ", " "], "title": ["Australian court orders Vatican Treasurer Pell to stand trial"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tNORRISTOWN, Pa. (Reuters) - Comedian Bill Cosby was convicted on Thursday of drugging and sexually assaulting a onetime friend in 2004, marking the first such con..."], "date": [" April 27, 2018 06:54 pm"], "comments": ["Comments - 0 / views : 81 ", " "], "title": ["Bill Cosby, once beloved 'America's Dad,' convicted of sexual assault"]},
{"newsitem": ["\r\n\tGENEVA (Reuters) - Israel must stop the excessive use of force by its security forces along the Gaza border and must hold to account those responsible for the many deaths and in..."], "date": [" April 27, 2018 06:10 pm"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["U.N. rights chief decries Israel's excessive use of force in Gaza"]},
{"newsitem": ["\r\n\tYANGON (Reuters) - Myanmar civil groups signed an open letter to the country’s president on Thursday, urging him to immediately release two Reuters reporters accused of po..."], "date": [" April 27, 2018 06:03 pm"], "comments": ["Comments - 0 / views : 24 ", " "], "title": ["Myanmar activists urge president to release jailed Reuters journalists"]},
{"newsitem": ["\r\n\tSEOUL (Reuters) - The leaders of North and South Korea embraced on Friday after pledging to work for the “complete denuclearization of the Korean peninsula”, on a da..."], "date": [" April 27, 2018 05:54 pm"], "comments": ["Comments - 0 / views : 68 ", " "], "title": ["Korean leaders aim for end of war, 'complete denuclearization' after historic summit"]},
{"newsitem": ["\r\n\tNEW DELHI (Reuters) - An Indian court jailed a self-styled religious preacher for life on Wednesday for raping a teenage girl, the latest sexual abuse case against a so-called &..."], "date": [" April 25, 2018 06:00 pm"], "comments": ["Comments - 0 / views : 71 ", " "], "title": ["Self-styled Indian 'godman' jailed for life for teen rape"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tBANDA ACEH, Indonesia (Reuters) - Firefighters in Indonesia are struggling to contain a blaze at an oil well in the northwestern province of Aceh that killed ten ..."], "date": [" April 25, 2018 12:19 pm"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["Fire at oil well in Indonesia's Aceh kills 10, injures 40"]},
{"newsitem": ["\r\n\t \r\n\r\n\r\n\r\n\tSAN SALVADOR (Reuters) - Honduras called on Monday for the United States to stop separating immigrant children from their parents at the U.S. border, while El Sal..."], "date": [" June 19, 2018 02:28 pm"], "comments": ["Comments - 0 / views : 7 ", " "], "title": ["Honduras, El Salvador decry U.S. border separations impact on kids"]},
{"newsitem": ["\r\n\tBEIJING/SEOUL (Reuters) - North Korean leader Kim Jong Un arrived in Beijing on Tuesday, where he will likely brief Chinese President Xi Jinping on his summit with U.S. Presiden..."], "date": [" June 19, 2018 02:00 pm"], "comments": ["Comments - 0 / views : 8 ", " "], "title": ["North Korea's Kim visit Beijing; South Korea, U.S. halt military drill"]},
{"newsitem": ["\r\n\tThe Taliban refused to extend their ceasefire beyond Sunday night, dampening hopes for peace after jubilant scenes over the Eid holidays in Afghanistan.\r\n\r\n\r\n\r\n\tThe announcement..."], "date": [" June 18, 2018 12:56 pm"], "comments": ["Comments - 0 / views : 13 ", " "], "title": ["Taliban refuse to extend Afghanistan ceasefire, as suicide attack kills 18"]},
{"newsitem": ["\r\n\tTOKYO (Reuters) - A magnitude 6.1 earthquake shook Osaka, Japan’s second-biggest metropolis, early on Monday morning, killing three people, halting factory lines in a key ..."], "date": [" June 18, 2018 12:20 pm"], "comments": ["Comments - 0 / views : 25 ", " "], "title": ["Magnitude 6.1 quake in Japan's Osaka area kills three, stops factories"]},
{"newsitem": ["\r\n\tAMSTERDAM (Reuters) - A van struck four people at a Dutch concert in the early hours of Monday morning, killing one and injuring three, hours after R&B artist Bruno Mars had..."], "date": [" June 18, 2018 12:16 pm"], "comments": ["Comments - 0 / views : 11 ", " "], "title": ["Police search for van that killed one, injured three at Dutch concert"]},
{"newsitem": ["\r\n\tGLASGOW, Scotland (Reuters) - A major fire has torn through one of Scotland’s architectural gems, the Mackintosh building at the Glasgow School of Art, for the second time..."], "date": [" June 16, 2018 07:25 pm"], "comments": ["Comments - 0 / views : 21 ", " "], "title": ["Major fire ravages celebrated Glasgow School of Art for second time"]},
{"newsitem": ["\r\n\tBEIJING (Reuters) - China’s navy carried out drills in the South China Sea to simulate fending off an aerial attack, state media said on Friday, as the country trades barb..."], "date": [" June 15, 2018 05:23 pm"], "comments": ["Comments - 0 / views : 22 ", " "], "title": ["China holds missile drills in South China Sea amid heightened tension"]},
{"newsitem": ["\r\n\tLONDON (Reuters) - Former tennis champion Boris Becker has claimed diplomatic immunity from bankruptcy proceedings against him by taking up a role with the Central African Repub..."], "date": [" June 15, 2018 05:22 pm"], "comments": ["Comments - 0 / views : 37 ", " "], "title": ["Boris Becker claims diplomatic immunity to fend off bankruptcy case"]},
{"newsitem": ["\r\n\tAt the start of his trial last June, Samsoor Lahoo flashed a boyish smile at the cameras as he entered the packed Hungarian courtroom in handcuffs to face charges over the grues..."], "date": [" June 15, 2018 04:37 pm"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["'If they die drop them in a forest': the ringleader behind the migrant death truck"]},
{"newsitem": ["\r\n\tSEOUL (Reuters) - North Korea has produced a film on leader Kim Jong Un’s summit meeting with President Donald Trump this week, feeding, as one would expect, a fervid cult..."], "date": [" June 15, 2018 04:18 pm"], "comments": ["Comments - 0 / views : 20 ", " "], "title": ["North Korean film on Kim's Singapore trip reveals new focus on economy"]},
{"newsitem": ["\r\n\tEmerging Schools- Schoolboy Cricketer of the Year and Best Batsman, Raveen Yasas of Devapathiraja College, Rathgama, is a highly experienced 5th-year Coloursman who has also pla..."], "date": [" June 11, 2018 12:00 am"], "comments": ["Comments - 0 / views : 6 ", " "], "title": ["Dialog-ST 2018: Emergence of a rising star in Raveen Yasas of Devapathiraja"]},
{"newsitem": ["\r\n\tRunner-up, Best Wicketkeeper Teron Baskaran, as a fresher in the senior side and to win an award in an All-Island Contest, is an outstanding achievement in any sport, in one&rsq..."], "date": [" June 10, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 12 ", " "], "title": ["Dialog-ST 2018: DSS Rookie wicketkeeper Teron Baskaran stands tall behind the stumps"]},
{"newsitem": ["\r\n\tThirty two teams have qualified to play in the Second Round of the Division III Cricket Tournament and CDCA Trophy 2018 in eight Groups with four teams in each group. \r\n\r\n\r..."], "date": [" June 10, 2018 06:00 pm"], "comments": ["Comments - 0 / views : 12 ", " "], "title": ["Cricket: Thirty two teams qualify CDCA Div. III Round 2"]},
{"newsitem": ["\r\n\tA major battle is brewing between the National Olympic Committee and Sri Lanka's ex-Olympians over rival events they have organised to mark the Olympic Day Run. \r\n\r\n\r\n..."], "date": [" June 10, 2018 03:00 pm"], "comments": ["Comments - 0 / views : 23 ", " "], "title": ["Athletics: NOC-SLO feud hots up over Olympian Run"]},
{"newsitem": ["\r\n\tThe Attorney General's (AG) Department will ask the Court of Appeal's permission to allow a Competent Authority (CA) overseeing Sri Lanka Cricket (SLC) to constitute a..."], "date": [" June 10, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 26 ", " "], "title": ["Cricket: Appointment of Competent Authority to SLC is illegal says expert"]},
{"newsitem": ["\r\n\tSri Lanka Junior Women’s Volleyball (VB) team skipper Dinusha Dilrukshi says that, defeating Uzbekistan in Vietnam will be their first target on Sunday (10), at the Asian ..."], "date": [" June 10, 2018 10:00 am"], "comments": ["Comments - 0 / views : 81 ", " "], "title": ["Volleyball: Sri Lanka's opening Asian Under-19 Women’s match today"]},
{"newsitem": ["\r\n\tFollowing Aruna Darshana’s record breaking run in the men’s 400m run on Friday (8), women’s steeplechaser Parami Wasanthi Marisstella produced a stunning perfo..."], "date": [" June 10, 2018 09:00 am"], "comments": ["Comments - 0 / views : 15 ", " "], "title": ["Athletics: Steeplechaser Marisstella brings home another gold"]},
{"newsitem": ["\r\n\tWhen the Josephians take the field today (10) for their last championship game against Isipathana, the first name could find that their goose has already been cooked. \r\n\r\n\r..."], "date": [" June 10, 2018 06:00 am"], "comments": ["Comments - 0 / views : 13 ", " "], "title": ["U-19 Rugby: Joe-Pathana clash today"]},
{"newsitem": ["\r\n\tThe curtains of the Super Four Inter-Provincial limited over tournament will come down on Sunday (10) with the repeat clash between defending champions -- Team Colombo and runne..."], "date": [" June 10, 2018 03:00 am"], "comments": ["Comments - 0 / views : 34 ", " "], "title": ["Cricket: Colombo and Galle in quest of Super 4 Inter-Provincial title"]},
{"newsitem": ["\r\n\tSri Lanka women’s suffered a shock four wicket defeat against Thailand women in their last Asia Cup group match played in Kuala Lumpur, Malaysia on Saturday (9).\r\n\t \r..."], "date": [" June 10, 2018 01:01 am"], "comments": ["Comments - 0 / views : 37 ", " "], "title": ["Cricket: Thailand humiliate Sri Lanka at Women's Asia Cup"]},
{"newsitem": ["\r\n\tOver a one-third of the membership of the National Olympic Committee of Sri Lanka (NOCSL) have collectively made a request through a letter to the Auditor General (AG), urging a..."], "date": [" June 11, 2018 04:00 pm"], "comments": ["Comments - 0 / views : 15 ", " "], "title": ["NOC: Members seek NOC audited accounts re-examined"]},
{"newsitem": ["\r\n\tRohan Sanjaya of Tissa Central College, Kalutara, is a rare type of bowler, representing a school with the minimum facilities, was adjudged Emerging Schools' Best Bowler.&n..."], "date": [" June 11, 2018 03:00 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["Dialog-St 2018: Tissa Central's Rohan Sanjaya Emerging Schools' Best Bowler"]},
{"newsitem": ["\r\n\tFormer Sri Lanka Rugby 7s sensation, Radhika Hettiarachchi has been offered the Head Coach position by the Nepal Rugby Association (NRA).\r\n\r\n\r\n\r\n\tHettiarachchi will be in-charge..."], "date": [" June 11, 2018 02:00 pm"], "comments": ["Comments - 0 / views : 32 ", " "], "title": ["Rugby: Radhika Hettiarachchi appointed Nepal coach"]},
{"newsitem": ["\r\n\tSri Lanka finished overall fifth with a tally of nine medals at the Asian Junior Athletics Championship concluded in Gifu, Japan on Sunday (10).\r\n\r\n\r\n\r\n\tSri Lanka claimed three ..."], "date": [" June 11, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 82 ", " "], "title": ["Athletics: Sri Lanka finish overall fifth with nine medals at Asian Junior Championship"]},
{"newsitem": ["\r\n\tSt. Joseph's College and Mahamaya Girls' School Kandy retained their titles at the 45th Milo All-Island Schools Swimming and Diving Championship 2018 concluded at the ..."], "date": [" June 11, 2018 11:30 am"], "comments": ["Comments - 0 / views : 23 ", " "], "title": ["Swimming: St. Joseph's and Mahamaya retain Schools Swimming crowns"]},
{"newsitem": ["\r\n\tSri Lanka opener and Team Galle skipper Upul Tharanga hit a brilliant knock of 124 off 122 deliveries to guide his team to an emphatic 75-run win against Team Colombo and secure..."], "date": [" June 11, 2018 11:20 am"], "comments": ["Comments - 0 / views : 39 ", " "], "title": ["Cricket: Tharanga lead Galle to SLC Super 4s Limited Overs crown"]},
{"newsitem": ["\r\n\tSt. Joseph's College made a gallant fight back to overcome Isipathana College 34-29 in a highly competitive Singer Schools Rugby League Championship 2018 match at Havelock ..."], "date": [" June 11, 2018 11:17 am"], "comments": ["Comments - 0 / views : 23 ", " "], "title": ["U-19 Rugby: St. Joseph's beat Isipathana 34-29 to emerge League runners-up"]},
{"newsitem": ["\r\n\t‘Runner-up- All Island Best Fielder’- Sachintha Ravindu of St. Joseph’s College, Colombo, expects every ball to comes his way, enabling him maintain his concen..."], "date": [" June 11, 2018 09:00 am"], "comments": ["Comments - 0 / views : 8 ", " "], "title": ["Dialog-ST 2018: Ravindu -- One of the safest hands in Schoolboy Cricket"]},
{"newsitem": ["\r\n\tIt has been brought to the attention of media attention by many activists and current Sepaktakraw Players that the present administrators of the Amateur Sepaktakraw Association ..."], "date": [" June 11, 2018 06:00 am"], "comments": ["Comments - 0 / views : 27 ", " "], "title": ["Sepaktakraw: A sports Association on reverse gear"]},
{"newsitem": ["\r\n\tRanjith Chandrasekera was a leading motorcycle rider spanning the era of late 1960’s to the early 80’s. \r\n\r\n\r\n\r\n\tHe was a much feared and dare devil rider who d..."], "date": [" June 11, 2018 03:00 am"], "comments": ["Comments - 1 / views : 43 ", " "], "title": ["Motorsports: Ranjith -- the first to summit Pidurutalagala on a bike"]},
{"newsitem": ["\r\n\tWesley College recorded a stunning 22-15 win against favourites Isipathana College to win the quarterfinal match of the Milo Presidents Cup Knockout Rugby Championship played at..."], "date": [" June 19, 2018 07:25 am"], "comments": ["Comments - 0 / views : 30 ", " "], "title": ["U-19 Rugby: Wesley edge out Isipathana to reach KO semis"]},
{"newsitem": ["\r\n\tSt. Peter’s College thrashed St. Anthony's College Kandy, 39-12 to win their quarter-final match of the Milo Presidents' Cup Knockout Championship played at the ..."], "date": [" June 19, 2018 07:24 am"], "comments": ["Comments - 0 / views : 14 ", " "], "title": ["U-19 Rugby: Peterites thrash Antonians 39-12 to reach KO semis"]},
{"newsitem": ["\r\n\tKingswood College stunned favourites Trinity College, winning the Milo President' Cup Knockout Championship quarterfinal match by 24-15 at Nittawela on Sunday (17).\r\n\r\n\r\n\r\n..."], "date": [" June 19, 2018 07:16 am"], "comments": ["Comments - 0 / views : 13 ", " "], "title": ["U-19 Rugby: Kingswood stun Trinity 24-15 to reach KO semis"]},
{"newsitem": ["\r\n\t Sri Lanka captain Dinesh Chandimal has pleaded not guilty to ball-tampering charges, prompting a hearing into the episode after the conclusion of the ongoing second test a..."], "date": [" June 18, 2018 11:24 am"], "comments": ["Comments - 0 / views : 54 ", " "], "title": ["Ball-tampering hearing scheduled after Chandimal denies charge"]},
{"newsitem": ["\r\n\tAngelo Mathews, who went on tour with the national team for West Indies will be returning to Sri Lanka, due to a personal reason.\r\n\r\n\r\n\r\n\tMeanwhile, bowler Lahiru Gamage, who su..."], "date": [" June 13, 2018 02:35 pm"], "comments": ["Comments - 0 / views : 67 ", " "], "title": ["SL in WI: Mathews, Gamage return home"]},
{"newsitem": ["\r\n\tThe much looked forward to Milo President’s Trophy Under-19 Schools Knockout Rugby Tournament has been slotted to kick off from June 16 at the Sugathadasa Stadium. \r\n..."], "date": [" June 12, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 88 ", " "], "title": ["U-19 Rugby: Joes looking to retain Milo Schools Knockout title"]},
{"newsitem": ["\r\n\tTen teams will be action in the Under-19 Inter-Provincial cricket tournament scheduled to get underway on June 12 in five venues around the metropolis -- NCC, Thurstan, Colts, F..."], "date": [" June 12, 2018 09:00 am"], "comments": ["Comments - 0 / views : 46 ", " "], "title": ["U-19 Cricket: Ten teams in the hunt for the Provincial title"]},
{"newsitem": ["\r\n\tThe 9th Trinco Blu Sailing Regatta hosted Royal Colombo Yacht Club (RCYC) Regatta 2018 is scheduled to be held on June 30 in Trincomalee with a record number of 50 boats in acti..."], "date": [" June 12, 2018 03:00 am"], "comments": ["Comments - 0 / views : 22 ", " "], "title": ["Sailing: 9th Trinco Blu Regatta on June 30"]},
{"newsitem": ["\r\n\tHandling of the Singer Schools’ Rugby league is under scrutiny. \r\n\r\n\r\n\r\n\tThe issue had been cooking on low flame for some time, but with the recent eruption of crowd ..."], "date": [" June 12, 2018 12:00 am"], "comments": ["Comments - 0 / views : 49 ", " "], "title": ["Rugby: SLR disturbed by schools’ rugby status quo"]},
{"newsitem": ["\r\n\tThe fixtures for the Sri Lanka Under-19 and India Under-19 team who are schedule to arrive in Sri Lanka on July 10 have been finalised. \r\n\r\n\r\n\r\n\tThe two teams will play eac..."], "date": [" June 11, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 129 ", " "], "title": ["U-19 Cricket: 7-match Sri Lanka vs India tour from July 16"]},
{"newsitem": ["\r\n\tRoyal College defeated St. Peter's College by 32-13 in the most decisive Cup Segment match of the Singer Schools League Rugby Championship, as they defended the title as un..."], "date": [" June 10, 2018 12:19 am"], "comments": ["Comments - 0 / views : 77 ", " "], "title": ["U-19 Rugby: Royal beat Petes 32-13 to retain Singer League title"]},
{"newsitem": ["\r\n\tTrinity College beat Zahira College by 34-15 in their final second round match of the Singer Schools League Rugby Championship played at Pallekele on Saturday (9).\r\n\r\n\r\n\r\n\tAt ha..."], "date": [" June 10, 2018 12:09 am"], "comments": ["Comments - 0 / views : 18 ", " "], "title": ["U-19 Rugby: Trinity beat Zahira 34-15"]},
{"newsitem": ["\r\n\tKingswood College recorded a thumping 31-13 win against Wesley College in their Singer Schools League Rugby Championship match played for the L.E. Blaze Trophy at the Racecourse..."], "date": [" June 10, 2018 12:05 am"], "comments": ["Comments - 0 / views : 14 ", " "], "title": ["U-19 Rugby: Kingswood trash Wesley 31-13 to win L.E. Blaze Trophy"]},
{"newsitem": ["\r\n\tS. Thomas' College Mt. Lavinia defeated D.S. Senanayake College by 24-19 to emerge Singer Schools League Plate Championship winners in their match played at Havelock Park o..."], "date": [" June 09, 2018 11:59 pm"], "comments": ["Comments - 0 / views : 14 ", " "], "title": ["U-19 Rugby: S. Thomas' beat DSS to claim Plate title"]},
{"newsitem": ["\r\n\tBowling allrounder, Chamika Karunaratne, who was reported for suspected bowling action in the Sri Lanka Cricket (SLC) Super Provincial Tournament 2018, has been cleared to bowl ..."], "date": [" June 06, 2018 02:00 pm"], "comments": ["Comments - 0 / views : 216 ", " "], "title": ["Cricket: Chamika Karunaratne cleared off suspected bowling action"]},
{"newsitem": ["\r\n\tThe 45th Sri Lanka Schools Swimming Championship will get underway at the Sugathadasa Swimming Complex in Colombo from today (6).\r\n\r\n\r\n\r\n\tThe event organised by Sri Lanka School..."], "date": [" June 06, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 137 ", " "], "title": ["Swimming: 45th Sri Lanka Schools Championship from today"]},
{"newsitem": ["\r\n\tThe National Shooting Sports Federation (NSSF) Trap Open Meet 2018 will be held from June 21 to 24 at the Clay Target Shooting Club of Colombo, Payagala and the meet will be con..."], "date": [" June 06, 2018 11:15 am"], "comments": ["Comments - 0 / views : 17 ", " "], "title": ["Shooting: NSSF Trap Open meet from June 21 to 24"]},
{"newsitem": ["\r\n\tSri Lanka weightlifter Chamari Warnakulasuriya, is likely to be awarded with the bronze of the Women's Weightlifting 53kg event, after the gold medal winner, Sanjitha Khumu..."], "date": [" June 06, 2018 11:14 am"], "comments": ["Comments - 0 / views : 61 ", " "], "title": ["Weightlifting: Sri Lanka likely to get seventh Commonwealth Games medal"]},
{"newsitem": ["\r\n\tThe selection committee of Sri Lanka Schools Hockey Association (SLSHA) has picked a national pool of 37 players, who are representing leading hockey playing schools in the isla..."], "date": [" June 05, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["Hockey: SLSHA selects pool of 37 tour of Bangladesh"]},
{"newsitem": ["\r\n\tDays after deciding to pull out from the upcoming 18th Asian Games 2018 to be held in Indonesia, Shirantha Peries, the President of National Shooting Sports Federation of Sri La..."], "date": [" June 05, 2018 09:00 am"], "comments": ["Comments - 0 / views : 26 ", " "], "title": ["Shooting: Shirantha Peries explains why NSSF decided to opt out Asian Games"]},
{"newsitem": ["\r\n\tSri Lanka Cricket (SLC) on Friday went into damage control mode after the Barmy Army's incensed reaction to what it said were exorbitant ticket prices for the upcoming Engl..."], "date": [" May 28, 2018 12:00 pm"], "comments": ["Comments - 6 / views : 609 ", " "], "title": ["Cricket: Barmy Army war -- SLC on damage control mode"]},
{"newsitem": ["\r\n\tThe National Shooting Sports Federation of Sri Lanka (NSSF) has decided to forego the upcoming 18th Asian Games 2018 to be held in Jakarta and Palembang, citing the continuous d..."], "date": [" May 28, 2018 09:00 am"], "comments": ["Comments - 0 / views : 63 ", " "], "title": ["Shooting: NSSF sticks to its guns and shoots down Asian Games trip"]},
{"newsitem": ["\r\n\tMinister of Sports, Faiszer Mustapha chaired a forum on Friday morning with Sri Lanka Rugby Referees' Society (SLRRS) chief Nizam Jamaldeen, Sri Lanka Schools Rugby Footbal..."], "date": [" May 28, 2018 06:00 am"], "comments": ["Comments - 1 / views : 88 ", " "], "title": ["Rugby: Schools League jigsaw patched up"]},
{"newsitem": ["\r\n\tA schoolboy batsman of the highest calibre, a prolific scorer in all three formats of cricket, is none other than Best Batsman-Runner-up Revan Kelly, the Josephian batting prodi..."], "date": [" May 28, 2018 03:00 am"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["Dialog-ST 2018: Revan Kelly's exploits make him second to one"]},
{"newsitem": ["\r\n\tA Cricket Captain's dream is to have his school play in Division I, which was fulfilled by none other than Randeera Krishan Ranasinghe, the Skipper of St. Anne's Colle..."], "date": [" May 28, 2018 12:00 am"], "comments": ["Comments - 0 / views : 29 ", " "], "title": ["Dialog-ST 2018: A rising Star in Randeera Ranasinghe of St. Anne's College, Kurunegala"]},
{"newsitem": ["\r\n\tChina has pledged to back Sri Lanka’s medal campaign at next year’s South Asian Games offering to host and train athletes at no cost to the local federations. \r..."], "date": [" May 27, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 52 ", " "], "title": ["NOC: China on a Sri Lankan medal drive for 2019 SA games"]},
{"newsitem": ["\r\n\tThe Standard Chartered Bank sponsored a special Golf Tournament conducted at the picturesque Shangri-La Hambantota Golf Course for Standard Chartered Bank, Customers, who were h..."], "date": [" May 27, 2018 06:00 pm"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["Golf: Avancka Herat win Standard Chartered Bank title too"]},
{"newsitem": ["\r\n\tRugby referees in Sri Lanka are presently accused of incompetence in handling the Schools’ League. \r\n\r\n\r\n\r\n\tThere is concern over the physical fitness of referees in ..."], "date": [" May 27, 2018 03:00 pm"], "comments": ["Comments - 0 / views : 40 ", " "], "title": ["Rugby: Jamaldeen speaks of referee’s role in crowd behaviour"]},
{"newsitem": ["\r\n\tSri Lanka Cricket on Friday (25) woke up from a long slumber and hurriedly set up an independent committee to study a domestic match-fixing scandal that rocked the country last ..."], "date": [" May 27, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 41 ", " "], "title": ["Cricket: SLC wakes up with an independent committee of inquiry for match-fixing scandal"]},
{"newsitem": ["\r\n\tThe Sri Lanka Air Force (SLAF) won Gold, while the Clay Target Shooting Sports Club (CTSSC) clinched Silver in the Open Men's and Ladies' Team Championship respectivel..."], "date": [" May 27, 2018 09:00 am"], "comments": ["Comments - 0 / views : 18 ", " "], "title": ["Shooting: CTSSC's Shankar Dharmaratne wins NSSF Skeet Open"]},
{"newsitem": ["\r\n\tGeorge Patrick Sisira Kumara completed a pillar to post victory as he returned a 3 under par closing Round to hold on to the lead, by 2 strokes from Amarapadma who finished stro..."], "date": [" May 27, 2018 06:00 am"], "comments": ["Comments - 0 / views : 34 ", " "], "title": ["Golf: Sisira Kumara wins Grand Prix May Edition"]},
{"newsitem": ["\r\n\tThere are ominous signs that the SLC Annual General Meeting scheduled for May 31 would be postponed. \r\n\r\n\r\n\r\n\tAccording reliable sources a case has been filed in the Colomb..."], "date": [" May 27, 2018 03:00 am"], "comments": ["Comments - 0 / views : 33 ", " "], "title": ["Cricket: SLC AGM to be postponed?"]},
{"newsitem": ["\r\n\tThe final matches of the 12th Mercantile Knock-Out Basketball Tournament 2018 for the Ram Rathnavel Memorial Trophy scheduled to be played at the Edward Henry Pedris Sports Comp..."], "date": [" May 27, 2018 12:00 am"], "comments": ["Comments - 0 / views : 29 ", " "], "title": ["Basketball: Ram Rathnavel Knockout finals rescheduled"]},
{"newsitem": ["\r\n\tThe Minister of Sports, Faiszer Mustapha, issued an official press release stating that he had instructed Sri Lanka Rugby (SLR) and Sri Lanka Rugby Referees' Society (SLRRS)..."], "date": [" May 23, 2018 05:23 pm"], "comments": ["Comments - 0 / views : 80 ", " "], "title": ["U-20 Rugby: Sports Minister directs to stall referees from matches until matters are resolved"]},
{"newsitem": ["\r\n\tSri Lanka’s tour of the West Indies hangs in the balance due to a financial crisis facing West Indies Cricket Board. \r\n\r\n\r\n\r\n\tSri Lankan cricketers are due to leave o..."], "date": [" May 22, 2018 03:00 am"], "comments": ["Comments - 0 / views : 75 ", " "], "title": ["Cricket: Fate of Windies tour to be decided on Tuesday"]},
{"newsitem": ["\r\n\tFormer National cricket star Pramodya Wickremasinghe, who was a member of Sri Lanka's 1996 ICC World Cup winning effort, says that more than 80 percent of the former intern..."], "date": [" May 22, 2018 12:00 am"], "comments": ["Comments - 0 / views : 151 ", " "], "title": ["Cricket: Ex-cricketers want to take over administration to save the game"]},
{"newsitem": ["\r\n\tFor young Kamindu Mendis the path is almost clear. Up to now his record has spoken for itself and that mere fact made our task of selecting Schoolboy Cricketer of the year was m..."], "date": [" May 21, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 112 ", " "], "title": ["Dialog-ST 2018: Kamindu Mendis, Schoolboy Cricketer of the Year 2018"]},
{"newsitem": ["\r\n\tBatsman Angelo Mathews says that he is “very excited to be back” as he approaches his anticipated return from a long injury lay-off. \r\n\r\n\r\n\r\n\tMathews, who will ..."], "date": [" May 21, 2018 06:00 pm"], "comments": ["Comments - 0 / views : 51 ", " "], "title": ["Cricket: Mathews exited to be back – but will not bowl"]},
{"newsitem": ["\r\n\tReigning champions Seetha Devi girls, Kandy once again proved their dominance in school hockey by winning three championship titles (Under-14, 16 and 18) at the Kandy District S..."], "date": [" May 21, 2018 03:00 pm"], "comments": ["Comments - 0 / views : 27 ", " "], "title": ["Hockey: Seetha Devi girls win P.T. Rajan Memorial 6s"]},
{"newsitem": ["\r\n\tThe Royal Colombo Golf Club Annual Grand Prix reached a climax when Sachin de Silva achieved the top rank in the gross ratings, ranked No 1 by a clear margin from youngster Vino..."], "date": [" May 21, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 24 ", " "], "title": ["Golf: Sachin and Avancka top RCGC Grand Prix"]},
{"newsitem": ["\r\n\tSri Lanka Air Force bagged two championship titles at the Sunquick National Beach Volleyball Championships concluded at the Sugathadasa New Beach Volleyball Courts on Saturday (..."], "date": [" May 20, 2018 03:00 am"], "comments": ["Comments - 0 / views : 28 ", " "], "title": ["Volleyball: Air Force bag two Beach Volleyball titles"]},
{"newsitem": ["\r\n\tDharshana Prasad Fernando of the North Western Province attached to the Sri Lanka Navy and Punchali Sulochana of the Western Province won the respective Men’s and Women&rs..."], "date": [" May 20, 2018 01:37 am"], "comments": ["Comments - 0 / views : 21 ", " "], "title": ["Cycling: Fernando and Sulochana take major honours at NSF"]},
{"newsitem": ["\r\n\tRoyal College edged Wesley College 18-17 to stay undefeated in the Cup Segment of the Singer Schools Under-19 League Rugby Championship played at Longdon Place on Saturday.\r\n\r\n\r..."], "date": [" May 20, 2018 12:48 am"], "comments": ["Comments - 0 / views : 120 ", " "], "title": ["U-19 Rugby: Royal edge Wesley 18-17 to stay unbeaten"]},
{"newsitem": ["\r\n\tSt. Joseph's College had to overcome anxiety before recording a 26-12 win against Zahira College in their Cup Segment match of the Singer Schools Under-19 Rugby League Cham..."], "date": [" May 19, 2018 06:45 pm"], "comments": ["Comments - 0 / views : 49 ", " "], "title": ["U-19 Rugby: Joes prevail Zahira scare 26-12"]},
{"newsitem": ["\r\n\tIsipathana College fought back to draw against Trinity College in their Cup Segment match of the Singer Schools Under-19 Rugby League Championship played at Havelock Park today ..."], "date": [" May 19, 2018 06:41 pm"], "comments": ["Comments - 0 / views : 80 ", " "], "title": ["U-19 Rugby: Isipathana draw Trinity 12-12"]},
{"newsitem": ["\r\n\tSt. Peter's College continued their unbeaten run in the ongoing Singer Schools League Rugby Championship, when they beat Kingswood College by 20-10 in a Cup Segment match a..."], "date": [" May 18, 2018 09:34 pm"], "comments": ["Comments - 0 / views : 29 ", " "], "title": ["U-19 Rugby: Petes down Kingswood 20-10"]},
{"newsitem": ["\r\n\tSri Lanka Cricket (SLC) announced on Thursday (17) that Angelo Mathews and Suranga Lakmal have been confirmed fit to take part in the upcoming West Indies tour.\r\n\r\n\r\n\r\n\t\"Bo..."], "date": [" May 17, 2018 05:56 pm"], "comments": ["Comments - 0 / views : 224 ", " "], "title": ["Cricket: Mathews and Lakmal fit for Windies tour"]},
{"newsitem": ["\r\n\tThe second of the two rugby players, who was under treatment in the Intensive Care Unit of a leading private hospital in Colombo has passed away a short while today (15).\r\n\r\n\r\n\r..."], "date": [" May 15, 2018 05:49 pm"], "comments": ["Comments - 0 / views : 188 ", " "], "title": ["Rugby: Second English player in ICU, dies"]},
{"newsitem": ["\r\n\tKandy Sports Club has appointed their former ace player Fazil Marija as the club's 7s coach for the upcoming Inter-Club Sevens Tournament, which will take place in June.\r\n\r..."], "date": [" May 15, 2018 03:58 pm"], "comments": ["Comments - 0 / views : 58 ", " "], "title": ["Rugby: Fazil Marija appointed Kandy SC 7s coach"]},
{"newsitem": ["\r\n\tSri Lanka Cricket (SLC) is seriously keen on appointing a fresh Selection Committee according to informed sources.\r\n\r\n\r\n\r\n\tWith the term of the present Selection Committee heade..."], "date": [" May 15, 2018 03:30 pm"], "comments": ["Comments - 0 / views : 309 ", " "], "title": ["Cricket: SLC keen to change Selection Committee"]},
{"newsitem": ["\r\n\tSt. Joseph's College defeated St. Peter's College 10-5 in a scrappy game of the Singer Schools Rugby League Championship played at Longdon Place today (2).\r\n\r\n\r\n\r\n\tJoe..."], "date": [" June 02, 2018 06:19 pm"], "comments": ["Comments - 0 / views : 61 ", " "], "title": ["U-19 Rugby: Joes beat Petes 10-5 in scrappy game"]},
{"newsitem": ["\r\n\tSri Lanka Cricket (SLC) on Monday (28) stated that it will temporarily suspend three of its staff members following the pitch-fixing scandal revealed by Qatar-based TV station, ..."], "date": [" May 29, 2018 12:41 pm"], "comments": ["Comments - 0 / views : 66 ", " "], "title": ["Cricket: SLC suspends three staffers over pitch-fixing scandal"]},
{"newsitem": ["\r\n\tThe Lanka Powerboat Association (LPA) has successfully won the rights to host the opening round of the H20 Racing International Aquabike Championship from March 22-24, 2019.&nbs..."], "date": [" May 29, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 58 ", " "], "title": ["Watersports: Colombo to host H20 Racing International Aquabike Championship 2019"]},
{"newsitem": ["\r\n\tAfter an undercover report exposed an alleged plot to fix the upcoming opening Test between Sri Lanka and England in November this year, Sri Lanka Cricket has decided to appoint..."], "date": [" May 29, 2018 09:00 am"], "comments": ["Comments - 0 / views : 43 ", " "], "title": ["Cricket: Foreign curators as 'pitch fixing gate' opens"]},
{"newsitem": ["\r\n\tFormer Sri Lanka Cricket secretary Nishantha Ranatunga says that even against seemingly heavy odds he has come forward to contest for the post of SLC President for the sole reas..."], "date": [" May 29, 2018 06:00 am"], "comments": ["Comments - 0 / views : 72 ", " "], "title": ["Cricket: Nishantha Ranatunga petitions against Thilanga Sumathipala candidacy"]},
{"newsitem": ["\r\n\tThe 12th edition of the Blue, Gold and Blue Western Province (WP) Invitation Schools Volleyball (VB) Championship 2018, organised and conducted by the Royal College Union Volley..."], "date": [" May 29, 2018 03:00 am"], "comments": ["Comments - 0 / views : 37 ", " "], "title": ["Volleyball: Blue, Gold and Blue Western Province Invitation Schools Championship in June"]},
{"newsitem": ["\r\n\tThe 4th Matale Thomians' All-Island Schools Hockey 7s 2018 will be conducted by the Matale Old Thomians' Hockey Association (MOTHA) on June 3 at Edward Park, Matale.&n..."], "date": [" May 29, 2018 12:00 am"], "comments": ["Comments - 0 / views : 67 ", " "], "title": ["Hockey: Matale Thomians' All-Island Schools 7s on June 3"]},
{"newsitem": ["\r\n\tKavisha Dilhari's contributions has been the cornerstone of Rathgama Devapathiraja College emerge champions in the All-Island Girls' Schools Cricket Championship in 20..."], "date": [" May 28, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 17 ", " "], "title": ["Dialog-ST 2018: Kavisha Dilhari's performances is more than her promise"]},
{"newsitem": ["\r\n\tBahrain RFC, who toured Sri Lanka to play two friendly Rugby Football games during April, donated Rugby equipment to four selected Schools from the Western Province. \r\n\r\n\r\n..."], "date": [" May 28, 2018 06:00 pm"], "comments": ["Comments - 0 / views : 43 ", " "], "title": ["Rugby: Magnanimous gesture by Bahrain RFC"]},
{"newsitem": ["\r\n\tThe National Shooting Sports Federation (NSSF) organised NSSF Open Rifle and Pistol Shooting Championship 2018 will be held from June 4 to 13 at the Sri Lanka Navy Small Bore Ra..."], "date": [" May 28, 2018 03:00 pm"], "comments": ["Comments - 0 / views : 40 ", " "], "title": ["Shooting: NSSF Rifle and Pistol Championship from June 4"]},
{"newsitem": ["\r\n\tThe name Weerakeppitipola National School, Akuramboda will be etched in the memory of sport fans for quite some time because of the feat of 19-year-old lad Aruna Dharshana, who ..."], "date": [" June 05, 2018 06:00 am"], "comments": ["Comments - 0 / views : 68 ", " "], "title": ["Athletics: Aruna Dharshana, a champion in the making"]},
{"newsitem": ["\r\n\tChoosing the Man-of-the-Series on Sri Lanka's visit to the Caribbean in March 2008 must have been a close run thing. \r\n\r\n\r\n\r\n\tRamnaresh Sarvan showed amazing consisten..."], "date": [" June 05, 2018 03:00 am"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["Cricket: Reminiscing the Caribbean tale of 2008"]},
{"newsitem": ["\r\n\tThis has been a strange election; first it was called, then it was ruled out. \r\n\r\n\r\n\r\n\tThen it was called again and put off once more after the Court of Appeal granted inte..."], "date": [" June 05, 2018 12:00 am"], "comments": ["Comments - 0 / views : 78 ", " "], "title": ["Cricket: Competent Authority - but will this augur well for the game?"]},
{"newsitem": ["\r\n\tThe 4th Matale Thomians’ All-Island Schools Hockey 7s 2018, conducted by the Matale Old Thomians’ Hockey Association got underway from Sunday (3) at the Edward Park,..."], "date": [" June 04, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 25 ", " "], "title": ["Hockey: 28 Under-20 teams for 4th Matale Thomians’ Schools 7s"]},
{"newsitem": ["\r\n\tFormer Sri Lanka Cricket secretary Nishantha Ranatunga, who is at present embroiled in a court case against the SLC, is of the view that one should not be afraid of Interim Comm..."], "date": [" June 04, 2018 06:00 pm"], "comments": ["Comments - 0 / views : 27 ", " "], "title": ["Cricket: I was forced to seek legal assistance -- Nishantha Ranatunga"]},
{"newsitem": ["\r\n\tGraeme La Brooy has been retained as chief cricket selector for another term along with Jeryl Wouterz, Gamini Wickremasinghe, Chandika Hathurusinghe (on tour selector) and Eric ..."], "date": [" June 04, 2018 05:02 pm"], "comments": ["Comments - 0 / views : 18 ", " "], "title": ["Cricket: La Brooy retained as chief selector"]},
{"newsitem": ["\r\n\tSri Lanka Cricket (SLC) has appointed former Sri Lanka captain Hashan Tillakaratne as the new coach of the Under-19 team.\r\n\r\n\r\n\r\n\tHis appointment is effective until the next ICC..."], "date": [" June 04, 2018 04:23 pm"], "comments": ["Comments - 0 / views : 24 ", " "], "title": ["Cricket: SLC appoints Hashan Tillakaratne as new Under-19 coach"]},
{"newsitem": ["\r\n\tSri Lanka cricketer Dhananjaya de Silva left the country on Sunday (3) to join the team in West Indies.\r\n\r\n\r\n\r\n\tDe Silva, who  was included in the 17-member Sri Lanka Test ..."], "date": [" June 04, 2018 04:20 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["Cricket: Dhananjaya leaves for West Indies"]},
{"newsitem": ["\r\n\tDefending champions Royal College recorded a smashing 41-7 win against Isipathana College in a Cup Segment match of the Singer Schools Rugby League Championship played at Havelo..."], "date": [" June 02, 2018 06:47 pm"], "comments": ["Comments - 0 / views : 116 ", " "], "title": ["U-19 Rugby: Royal thrash Isipathana 41-7 to regain Maj. Milroy Fernando Trophy"]},
{"newsitem": ["\r\n\tTrinity College overcame Wesley College 21-11 in a Cup Segment match of the Singer Schools Rugby League Championship played at Pallekele today (2).\r\n\r\n\r\n\r\n\tAt halftime Wesley le..."], "date": [" June 02, 2018 06:26 pm"], "comments": ["Comments - 0 / views : 49 ", " "], "title": ["U-19 Rugby: Trinity overcome Wesley 21-11"]},
{"newsitem": ["\r\n\tSri Lanka Cricket on Saturday (19) appointed a five-member Election Committee as per Sports Regulations to conduct its Annual General Meeting scheduled for May 31. \r\n\r\n\r\n\r\n..."], "date": [" May 21, 2018 09:00 am"], "comments": ["Comments - 0 / views : 45 ", " "], "title": ["Cricket: SLC's Elections Committee set up"]},
{"newsitem": ["\r\n\tCarey College, a school with a proud history, has produced some top cricketers. \r\n\r\n\r\n\r\n\tA cricketer who can bring honour to this school will be its Captain Denuwan Perera,..."], "date": [" May 21, 2018 06:00 am"], "comments": ["Comments - 0 / views : 35 ", " "], "title": ["Dialog-ST 2018: Carey's Denuwan is the Most Popular Cricketer in Emerging Schools"]},
{"newsitem": ["\r\n\tBeing selected to the National squad is a rare achievement for a schoolboy or schoolgirl. \r\n\r\n\r\n\r\n\tBut, Anula Vidyalaya Cricket Captain Harshita Madavi achieved this honour..."], "date": [" May 21, 2018 03:00 am"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["Dialog-ST 2018: Anula's Harshita Madavi, the Queen of Schoolgirl Cricketers"]},
{"newsitem": ["\r\n\tWith a heavy flow of votes in the final week, DS Senanayake College cricketer Vihan Gunasekera surged to the top as Most Popular Schoolboy Cricketer-All Island 2018. \r\n\r\n\r\n..."], "date": [" May 21, 2018 12:00 am"], "comments": ["Comments - 0 / views : 20 ", " "], "title": ["Dialog-ST 2018: Vihan of DSS, the All-ISland Most Popular Schoolboy Cricketer"]},
{"newsitem": ["\r\n\tTwenty seven teams representing leading hockey playing schools across the island will vie for honours at the 4th edition of 'Thomians Sevens 2018' - invitation schools..."], "date": [" May 20, 2018 09:00 pm"], "comments": ["Comments - 0 / views : 20 ", " "], "title": ["Hockey: Invitation Schools 7s on June 3"]},
{"newsitem": ["\r\n\tThe foreign partner in the joint venture that built the synthetic track at Sugathadasa Stadium has guaranteed \"durability and the overall performance characteristics of the..."], "date": [" May 20, 2018 06:00 pm"], "comments": ["Comments - 0 / views : 31 ", " "], "title": ["Athletics: CONICA says Sugathadasa track seep only a minor issue"]},
{"newsitem": ["\r\n\tAvancka Herat was elected Captain and past Captain Nimal Piyaratnewas elected President at the 139th Annual General Meeting of the Royal Colombo Golf Club (RCGC) held on March 2..."], "date": [" May 20, 2018 03:00 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["Golf: RCGC’s top posts for Avancka and Nimal"]},
{"newsitem": ["\r\n\tMcLarens Holdings (McLarens), Asia Asset, Maliban Biscuits (Maliban) and Hirdaramani Industries (Hirdaramani) emerged semifinalists in the 16th David Pieris Group of Co. sponsor..."], "date": [" May 20, 2018 12:00 pm"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["MCA Cricket: McLarens, Asia Asset, Maliban, Hirdaramani in Division 'E' semis"]},
{"newsitem": ["\r\n\tCommercial Credit & Finance PLC (CCF) Men's and Women's teams reached their respective finals in the 'A' Division of the 12th Mercantile Services Basketb..."], "date": [" May 20, 2018 09:00 am"], "comments": ["Comments - 0 / views : 19 ", " "], "title": ["Basketball: Commercial Credit Men and Women in 'A' Division K/O finals"]},
{"newsitem": ["\r\n\tMatale International School (MIS) Matale performed exceptionally well to clinch two titles at the Matale education zone - Inter School Netball Championship 2018 for the Nandimit..."], "date": [" May 20, 2018 06:00 am"], "comments": ["Comments - 0 / views : 41 ", " "], "title": ["Netball: Major honours for MIS Matale"]}
]